zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
*   \defgroup group_sysclk_clk_mem_funcs   Functions
* \}
* \defgroup group_sysclk_clk_pwr         Power Clock
* \{
*   Clock for the power architecture components.

*   \defgroup group_sysclk_clk_pwr_funcs   Functions
*   \defgroup group_sysclk_clk_pwr_enums    Enumerated Types
* \}

*/

#if !defined (CY_SYSCLK_H)
#define CY_SYSCLK_H

#include "cy_device.h"

#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
#include <stdbool.h>
#include "cy_syslib.h"
#include "cy_syspm.h"

#if defined(CY_DEVICE_SECURE)
    #include "cy_pra.h"
#endif /* defined(CY_DEVICE_SECURE) */


#if defined(__cplusplus)
extern "C" {
#endif /* __cplusplus */

/**
* \addtogroup group_sysclk_macros
* \{
*/
/** Driver major version */
#define  CY_SYSCLK_DRV_VERSION_MAJOR   3
/** Driver minor version */
#define  CY_SYSCLK_DRV_VERSION_MINOR   170
/** Sysclk driver identifier */
#define CY_SYSCLK_ID   CY_PDL_DRV_ID(0x12U)

/** ILO clock frequency */
#define CY_SYSCLK_ILO_FREQ  (32768UL)   /* Hz */
/** WCO clock frequency */
#define CY_SYSCLK_WCO_FREQ  (32768UL)   /* Hz */
/** PILO clock frequency */
#define CY_SYSCLK_PILO_FREQ (32768UL)   /* Hz */

/** IMO clock frequency */
#define CY_SYSCLK_IMO_FREQ  (8000000UL) /* Hz */

/** MFO clock frequency */
#define CY_SYSCLK_MFO_FREQ  (2000000UL) /* Hz */

/** CY_SYSCLK_PILO_TRIM_STEP is the default PILO TRIM Step value */
#define CY_SYSCLK_PILO_TRIM_STEP  (5UL) /* Default PILO TRIM Step size */

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS28SRSS)
/**
* \note
* This macro is available for CAT1B devices.
**/
/** IHO clock frequency */
#define CY_SYSCLK_IHO_FREQ  (48000000UL) /* Hz */

#elif defined (CY_IP_MXS22SRSS)
/**
* \note
* This macro is available for CAT1D devices.
**/
/** IHO clock frequency */
#define CY_SYSCLK_IHO_FREQ  (50000000UL) /* Hz */

#endif /* CY_IP_MXS40SSRSS,CY_IP_MXS28SRSS*/


#if defined (CY_IP_MXS40SRSS)
/**
* \note
* This macro is available for CAT1A devices.
**/
/** ECO clock frequency */
#define CY_SYSCLK_ECO_FREQ  (4000000UL) /* Hz */
#endif /* CY_IP_MXS40SRSS */


#if defined (CY_IP_MXS22SRSS)
/** Timer clock frequency */
#define CY_SYSCLK_TIMER_CLK_FREQ  (1000000UL) /* Hz */
#endif

#if defined (CY_IP_MXS40SSRSS)|| defined (CY_IP_MXS22SRSS)
/** FLL BYPASS configure Delay , As per SAS
* "When changing BYPASS_SEL, do not turn off the reference clock
* or CCO clock for ten cycles (whichever is slower)"
* Slower if IMO, so delay = (10 * 1/(IMO freq in Mhz))  = 1.25 micro seconds,
* approximated to 2 micro second
 **/
#define CY_SYSCLK_BYPASS_CONFIGURE_DELAY  (2UL) /* micro seconds */

/** FLL Disable Timeout value
**/
#define CY_SYSCLK_FLL_DISABLE_TIMEOUT     (100UL) /* micro seconds */

#else

/** FLL BYPASS configure Delay , As per SAS
* "When changing BYPASS_SEL, do not turn off the reference clock
* or CCO clock for seven cycles (whichever is slower)"
* Slower if IMO, so delay = (7 * 1/(IMO freq in Mhz))  = 0.875 micro seconds,
* approximated to 1 micro second
**/
#define CY_SYSCLK_BYPASS_CONFIGURE_DELAY  (1UL) /* micro seconds */

/** FLL Disable Timeout value
**/
#define CY_SYSCLK_FLL_DISABLE_TIMEOUT     (100UL) /* micro seconds */

#endif /* defined (CY_IP_MXS40SSRSS)|| defined (CY_IP_MXS22SRSS) */


/*******************************************************************************
*       Internal Defines
*******************************************************************************/
#if defined (CY_IP_MXS22SRSS)
/**
* \note
* This macro is valid for CAT1D devices.
**/
/* Macro to validate parameters in Cy_SysClk_ClkPathSetSource() function */
#define CY_SYSCLK_IS_CLKPATH_SOURCE_VALID(clkSrc)        (((clkSrc) == CY_SYSCLK_CLKPATH_IN_IHO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_EXT)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ECO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_IMO)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_WCO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_PILO))
#elif defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)
/**
* \note
* This macro is valid for CAT1A (TVIIBE only) and CAT1C devices.
**/
/* Macro to validate parameters in Cy_SysClk_ClkPathSetSource() function */
#define CY_SYSCLK_IS_CLKPATH_SOURCE_VALID(clkSrc)        (((clkSrc) == CY_SYSCLK_CLKPATH_IN_IMO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_EXT)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ECO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ILO0)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_WCO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ILO1))
#elif defined (CY_IP_MXS40SSRSS) && (defined (SRSS_ECO_PRESENT) && ((SRSS_ECO_PRESENT) > 0))
/**
* \note
* This macro is valid for CAT1B (only PSC3) devices.
**/
/* Macro to validate parameters in Cy_SysClk_ClkPathSetSource() function */
#define CY_SYSCLK_IS_CLKPATH_SOURCE_VALID(clkSrc)        (((clkSrc) == CY_SYSCLK_CLKPATH_IN_IMO)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_EXT)   || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ECO)   || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ALTHF) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_IHO)   || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ILO)   || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_WCO)   || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_PILO))
#elif defined (CY_IP_MXS40SSRSS)
/**
* \note
* This macro is valid for CAT1B devices (excluding PSC3).
**/
/* Macro to validate parameters in Cy_SysClk_ClkPathSetSource() function */
#define CY_SYSCLK_IS_CLKPATH_SOURCE_VALID(clkSrc)        (((clkSrc) == CY_SYSCLK_CLKPATH_IN_IMO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_EXT)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ALTHF) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ECO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_IHO)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ILO)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_WCO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_PILO))
#else
/**
* \note
* This macro is valid for CAT1A devices (excluding TVIIBE).
**/
/* Macro to validate parameters in Cy_SysClk_ClkPathSetSource() function */
#define CY_SYSCLK_IS_CLKPATH_SOURCE_VALID(clkSrc)        (((clkSrc) == CY_SYSCLK_CLKPATH_IN_IMO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_EXT)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ALTHF) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ECO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_ILO)  || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_WCO) || \
                                                         ((clkSrc) == CY_SYSCLK_CLKPATH_IN_PILO)
#endif

/** \} group_sysclk_macros */


/**
* \addtogroup group_sysclk_returns
* \{
*/
/** Defines general-purpose function return values */
typedef enum
{
    CY_SYSCLK_SUCCESS           = 0x00UL, /**< Command completed with no errors */
    CY_SYSCLK_BAD_PARAM         = (CY_SYSCLK_ID | CY_PDL_STATUS_ERROR | 0x01UL), /**< Invalid function input parameter */
    CY_SYSCLK_TIMEOUT           = (CY_SYSCLK_ID | CY_PDL_STATUS_ERROR | 0x02UL), /**< Timeout occurred */
    CY_SYSCLK_INVALID_STATE     = (CY_SYSCLK_ID | CY_PDL_STATUS_ERROR | 0x03UL), /**< Clock is in an invalid state */
    CY_SYSCLK_UNSUPPORTED_STATE = (CY_SYSCLK_ID | CY_PDL_STATUS_ERROR | 0x04UL) /**< Feature Unsupported */
} cy_en_sysclk_status_t;
/** \} group_sysclk_returns */


/* ========================================================================== */
/* ===========================    EXT SECTION    ============================ */
/* ========================================================================== */

/** \cond INTERNAL */
#if ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE)))
    /* Internal storage for external clock frequency user setting */
    extern uint32_t cySysClkExtFreq;
#endif /* ((CY_CPU_CORTEX_M4) && (defined(CY_DEVICE_SECURE))) */
/** \endcond */

/**
* \addtogroup group_sysclk_ext_funcs
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysClk_ExtClkSetFrequency
****************************************************************************//**
*
* Sets the signal frequency of the External Clock Source (EXTCLK) into the
* internal storage to be used in \ref Cy_SysClk_ClkHfGetFrequency.
*
* \param freq The frequency of the External Clock Source.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ExtClkSetFrequency
*
*******************************************************************************/
void Cy_SysClk_ExtClkSetFrequency(uint32_t freq);


