zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ExtClkGetFrequency
****************************************************************************//**
*
* Returns the frequency of the External Clock Source (EXTCLK) from the
* internal storage.
*
* \return The frequency of the External Clock Source.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ExtClkSetFrequency
*
*******************************************************************************/
uint32_t Cy_SysClk_ExtClkGetFrequency(void);
/** \} group_sysclk_ext_funcs */

/* ========================================================================== */
/* ===========================    ECO SECTION    ============================ */
/* ========================================================================== */

/**
* \addtogroup group_sysclk_macros
* \{
*/

/**
* \defgroup group_sysclk_ecostatus ECO status
* \{
* Constants used for expressing ECO status.
*/
#define CY_SYSCLK_ECOSTAT_AMPLITUDE  0UL /**< \brief ECO does not have sufficient amplitude */
#define CY_SYSCLK_ECOSTAT_INACCURATE 1UL /**< \brief ECO may not be meeting accuracy and duty cycle specs */
#define CY_SYSCLK_ECOSTAT_STABLE     2UL /**< \brief ECO has fully stabilized */

#if defined (CY_IP_MXS28SRSS)
/**
* \note
* This macro is available for CAT1B devices.
**/
#define CY_SYSCLK_ECOSTAT_BLE_DISABLED 0UL /**< \brief ECO for BLE is disabled */
/**
* \note
* This macro is available for CAT1B devices.
**/
#define CY_SYSCLK_ECOSTAT_BLE_ENABLED  1UL /**< \brief ECO for BLE is enabled */
#endif /* CY_IP_MXS28SRSS */

/** \} group_sysclk_ecostatus */

#if defined (CY_IP_MXS22SRSS)

/** \cond internal */
#define CY_SYSCLK_CLK_ECO_CTRIM_MIN     0x0U
#define CY_SYSCLK_CLK_ECO_CTRIM_MAX     0x1FU

#define CY_SYSCLK_CLK_ECO_GTRIM_MIN     0x0U
#define CY_SYSCLK_CLK_ECO_GTRIM_MAX     0xFU


#define CY_SYSCLK_IS_CLK_ECO_CTRIM_VALID(clkCtrim)    ((clkCtrim) <= CY_SYSCLK_CLK_ECO_CTRIM_MAX)

#define CY_SYSCLK_IS_CLK_ECO_GTRIM_VALID(clkGtrim)    ((clkGtrim) <= CY_SYSCLK_CLK_ECO_GTRIM_MAX)
/** \endcond */

#endif

# if (defined (CY_DEVICE_SECURE))
/**
* \note
* This structure is available for CAT1A devices.
**/
/** PRA structure for Cy_SysClk_EcoConfigure function parameters */
typedef struct
{
    uint32_t praClkEcofreq;                           /**< freq */
    uint32_t praCsum;                           /**< cSum */
    uint32_t praEsr;                             /**< esr */
    uint32_t praDriveLevel;                     /**< drivelevel */
} cy_stc_pra_clk_eco_configure_t;
#endif /* (defined (CY_DEVICE_SECURE)) */



#if defined (CY_IP_MXS22SRSS) || defined(CY_DOXYGEN)
/**
* \note
* This structure is available for CAT1D devices.
**/
/** structure for Cy_SysClk_EcoManualConfigure function parameters */
typedef struct
{
    uint32_t ecoClkfreq;                           /**< freq in Hz */
    uint32_t ecoCtrim;                             /**< ctrim */
    uint32_t ecoGtrim;                             /**< gtrim */
    bool     ecoIboost;                            /**< iboost */
} cy_stc_clk_eco_config_t;
#endif


/** \} group_sysclk_macros */

#if defined (CY_IP_MXS40SRSS)  || defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (SRSS_ECO_PRESENT == 1UL))
/** \cond */
/**
* \note
* This macro is available for CAT1A, CAT1B, CAT1C, and CAT1D devices.
**/
#define SRSS_CLK_ECO_STATUS_Msk (SRSS_CLK_ECO_STATUS_ECO_OK_Msk | SRSS_CLK_ECO_STATUS_ECO_READY_Msk)
/** \endcond */
#endif /* defined (CY_IP_MXS40SRSS)  || defined (CY_IP_MXS22SRSS) */

#if defined (CY_IP_MXS28SRSS)
/** \cond */
/**
* \note
* It is available for CAT1B devices.
**/
#define SRSS_CLK_ECO_STATUS_Msk (SRSS_CLK_ECO_STATUS_ECO_CORE_READY_Msk | SRSS_CLK_ECO_STATUS_ECO_CORE_AMP_OK_Msk)

/** \endcond */
#endif /* CY_IP_MXS28SRSS */



#if defined (CY_IP_MXS28SRSS)
/**
* \addtogroup group_sysclk_eco_enums
* \{
*/
/**
*   ECO enable options for BLE
*/
/**
* \note
* This enum is available for CAT1B devices.
**/
typedef enum
{
    CY_SYSCLK_ECO_BLESS_CONTROL0    =  0U, /**< 0, 1: hardware controlled by BLESS. */
    CY_SYSCLK_ECO_BLESS_CONTROL1    =  1U, /**< 0, 1: hardware controlled by BLESS. */
    CY_SYSCLK_ECO_FORCE_ENABLE      =  2U, /**< Force ECO enabled for use by BLE */
    CY_SYSCLK_ECO_FORCE_DISABLE     =  3U, /**< Force ECO disabled for use by BLE */
} cy_en_eco_for_ble_t;
/** \} group_sysclk_eco_enums */
#endif /* CY_IP_MXS28SRSS */

/**
* \addtogroup group_sysclk_eco_funcs
* \{
*/
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) || defined (CY_IP_MXS22SRSS) || \
     (defined (CY_IP_MXS40SSRSS) && (SRSS_ECO_PRESENT == 1UL)) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysClk_EcoSetFrequency
****************************************************************************//**
*
* Stores the external crystal oscillator (ECO) frequency in a global variable
* within Sysclk driver.
*
* \param freq Operating frequency of the crystal in Hz.
* Valid range depends on the selected device, refer to the device datasheet
* for more details.
*
* \note
* This API is available for CAT1A (excluding TVIIBE), CAT1B, CAT1C and CAT1D devices.
*
*******************************************************************************/
void Cy_SysClk_EcoSetFrequency(uint32_t freq);
#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) */

 #if defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (SRSS_ECO_PRESENT == 1UL))


#if defined (CY_IP_MXS22SRSS) || defined(CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysClk_EcoManualConfigure
****************************************************************************//**
*
* Configures the external crystal oscillator (ECO) trim bits based on crystal
* characteristics. This function should be called only when the ECO is disabled.
*
* \param ecoConfig \ref cy_stc_clk_eco_config_t
*
* \note
* This API expects the trims to be calculated outside this API scope, so refer
* and use the ECO calculators excel sheet for the platform to obtain the
* trims.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - ECO configuration completed successfully \n
* CY_SYSCLK_BAD_PARAM - One or more invalid parameters \n
* CY_SYSCLK_INVALID_STATE - ECO already enabled
*
* \note
* This API is available for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_EcoManualConfigure(const cy_stc_clk_eco_config_t *ecoConfig);

#endif //defined (CY_IP_MXS22SRSS) || defined(CY_DOXYGEN)
#if !defined (CY_IP_MXS22SRSS) || defined(CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysClk_EcoConfigure
****************************************************************************//**
*
* Configures the external crystal oscillator (ECO) trim bits based on crystal
* characteristics. This function should be called only when the ECO is disabled.
*
* \param freq Operating frequency of the crystal in Hz.
* Valid range depends on the selected device, refer to the device datasheet
* for more details.
*
* \param cSum The summary capacitance of
* C0 (the crystal itself shunt capacitance) and
* Cload (the parallel load capacitance), in pF.
* So cSum = C0 + Cload.
* Valid range: 1...100.
* \note
* For CAT1B Devices:
* cSum stands for crystal load capacitance in pF.
*
* \param esr Effective series resistance of the crystal in Ohms.
* Valid range: 1...1000.
*
* \param driveLevel Crystal drive level in uW.
* Valid range: 1...2000.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - ECO configuration completed successfully \n
* CY_SYSCLK_BAD_PARAM - One or more invalid parameters \n
* CY_SYSCLK_INVALID_STATE - ECO already enabled
* \note Behavior of this API is IP dependent. \n
* On CAT1A device: \n
*
* For the PSoC 64 devices there are possible situations when function returns
* the PRA error status code. This is because for PSoC 64 devices the function
* uses the PRA driver to change the protected registers. Refer to
* \ref cy_en_pra_status_t for more details.
* The following calculations are implemented in the 32-bit integer math:
* On PSoC 64 devices the configuration on the PRA driver will be reflected
* after \ref Cy_SysClk_EcoEnable call.
*
* \verbatim
*   freqKhz = freq / 1000
*   maxAmpl = sqrt(drivelevel / 2 / esr) / 3.14 / freqKhz / cSum
*   ampSect = INT(5 * 4 * 3.14^2 * freqKhz^2 * cSum^2 * 4 * esr / 1000000000 / 1000000 / 9)
*   As a result of the above calculations, max amplitude must be >= 0.65V, and the
*   number of amplifier sections must be <= 3, otherwise this function returns with
*   a parameter error.
*
*   atrim = 15
*   agc_en = 1
*   wdtrim = 7
*   gtrim = ampSect > 1 ? ampSect : ampSect == 1 ? 0 : 1
*   rtrim = 0
*   ftrim = 3
* \endverbatim
*
* \note
* On CAT1C Device: \n
*
* \verbatim

