zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_EcoPrescaleConfigure
****************************************************************************//**
*
* Configures the external crystal oscillator (ECO) using ECO Prescaler
* Configuration Register and derives clk_eco_prescaler
*
* \param enable ECO Prescaler enable/disable.
*
* \param int_div 10-bit integer value.
*
* \param frac_div 8-bit fraction value.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - ECO configuration completed successfully \n
* CY_SYSCLK_BAD_PARAM - One or more invalid parameters \n
* CY_SYSCLK_INVALID_STATE - ECO already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - ECO is not present
*
* \note
* This API is available for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_EcoPrescaleConfigure(uint32_t enable, uint32_t int_div, uint32_t frac_div);

/*******************************************************************************
* Function Name: Cy_SysClk_EcoPrescaleIsEnabled
****************************************************************************//**
*
* Reports whether or not ECO Prescale is enabled.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
bool Cy_SysClk_EcoPrescaleIsEnabled(void);


/*******************************************************************************
* Function Name: Cy_SysClk_EcoPrescaleGetFrequency
****************************************************************************//**
*
* Returns the frequency of the external crystal oscillator (ECO) prescaler.
*
* \return The frequency of the ECO Prescaler.
*
* \note If the ECO is not enabled or stable - a zero is returned.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C & CAT1D devices.
*
*******************************************************************************/
uint32_t Cy_SysClk_EcoPrescaleGetFrequency(void);

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (SRSS_ECO_PRESENT == 1UL))*/

#if defined (CY_IP_MXS28SRSS)
/*******************************************************************************
* Function Name: Cy_SysClk_EcoBleEnable
****************************************************************************//**
*
* Enables the external crystal oscillator (ECO) for BlueTooth Usage. This function should be called
* after \ref Cy_SysClk_EcoConfigure.
*
* \param control To be selected from \ref cy_en_eco_for_ble_t
*
* \param timeoutus timeoutus
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - ECO locked \n
* CY_SYSCLK_TIMEOUT - ECO timed out and did not lock \n
* CY_SYSCLK_INVALID_STATE - ECO already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - ECO is not present
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_EcoBleControl(cy_en_eco_for_ble_t control, uint32_t timeoutus);

/*******************************************************************************
* Function Name: Cy_SysClk_EcoBleGetStatus
****************************************************************************//**
*
* Reports the current status w.r.to BLE of the external crystal oscillator (ECO).
*
* \return
* CY_SYSCLK_ECOSTAT_BLE_ENABLED = ECO for BLE is enabled \n
* CY_SYSCLK_ECOSTAT_BLE_DISABLED = ECO for BLE is not enabled
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
uint32_t Cy_SysClk_EcoBleGetStatus(void);
#endif /* defined (CY_IP_MXS28SRSS) */

/** \} group_sysclk_eco_funcs */


/* ========================================================================== */
/* ==========================    LPECO SECTION    =========================== */
/* ========================================================================== */

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) && (defined (SRSS_BACKUP_S40E_LPECO_PRESENT) && (SRSS_BACKUP_S40E_LPECO_PRESENT == 1u))

/**
* \addtogroup group_sysclk_lpeco_enums
* \{
*/
/**
*   Backup domain LPECO load capacitance range.
*/
/**
* \note
* This enum is available for TVIIC devices.
**/
typedef enum
{
    CY_SYSCLK_BAK_LPECO_LCAP_5TO10PF    = 0u,   /**< Backup domain LPECO load is in range [5pF, 10pF] */
    CY_SYSCLK_BAK_LPECO_LCAP_10TO15PF   = 1u,   /**< Backup domain LPECO load is in range (10pF, 15pF] */
    CY_SYSCLK_BAK_LPECO_LCAP_15TO20PF   = 2u,   /**< Backup domain LPECO load is in range (15pF, 20pF] */
    CY_SYSCLK_BAK_LPECO_LCAP_20TO25PF   = 3u,   /**< Backup domain LPECO load is in range (20pF, 25pF] */

} cy_en_clkbak_lpeco_loadcap_range_t;

/**
*   Backup domain LPECO crystal frequency range.
*/
/**
* \note
* This enum is available for TVIIC devices.
**/
typedef enum
{
    CY_SYSCLK_BAK_LPECO_FREQ_4TO6MHZ     = 0u,   /**< Backup domain LPECO frequency is in range [4MHz, 6MHz) */
    CY_SYSCLK_BAK_LPECO_FREQ_6TO8MHZ     = 1u,   /**< Backup domain LPECO frequency is in range [6MHz, 8MHz] */

} cy_en_clkbak_lpeco_frequency_range_t;

/**
*   Backup domain LPECO crystal oscillation amplitude.
*/
/**
* \note
* This enum is available for TVIIC devices.
**/
typedef enum
{
    CY_SYSCLK_BAK_LPECO_AMP_MAX_1P35V    = 0u,   /**< Backup domain LPECO maximum amplitude is 1.35V. This is the lowest power setting. */
    CY_SYSCLK_BAK_LPECO_AMP_MAX_1P8V     = 1u,   /**< Backup domain LPECO maximum amplitude is 1.8V. This is the lowest jitter setting. */

} cy_en_clkbak_lpeco_max_amplitude_t;

/**
*   Backup domain LPECO minimum amplitude detection.
*/
/**
* \note
* This enum is available for TVIIC devices.
**/
typedef enum
{
    CY_SYSCLK_BAK_LPECO_AMPDET_INIT_EN      = 0u,   /**< Initially enabled, and then automatically disabled when amplitude detector detects sufficient amplitude. */
    CY_SYSCLK_BAK_LPECO_AMPDET_ALWAYS_EN    = 1u,   /**< Keep minimum amplitude detector enabled as long as LPECO is enabled */

