zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
} cy_en_clkbak_lpeco_amplitude_detect_t;
/** \} group_sysclk_lpeco_enums */


/**
* \addtogroup group_sysclk_lpeco_funcs
* \{
*/

/*******************************************************************************
* Function Name: Cy_SysClk_LpEcoConfigure
****************************************************************************//**
*
* Configures the low-power external crystal oscillator based on crystal characteristics
*
* \param capValue \ref cy_en_clkbak_lpeco_loadcap_range_t
*
* \param freqValue \ref cy_en_clkbak_lpeco_frequency_range_t
*
* \param ampValue \ref cy_en_clkbak_lpeco_max_amplitude_t
*
* \param ampDetEn Enable amplitude detection always (true) or only on init (false)
*
* \note
* This API is available for TVIIC devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_LpEcoConfigure
*
*******************************************************************************/
void Cy_SysClk_LpEcoConfigure(cy_en_clkbak_lpeco_loadcap_range_t capValue,
                              cy_en_clkbak_lpeco_frequency_range_t freqValue,
                              cy_en_clkbak_lpeco_max_amplitude_t ampValue,
                              bool ampDetEn);

/*******************************************************************************
* Function Name: Cy_SysClk_LpEcoEnable
****************************************************************************//**
*
* Enables the low-power external crystal oscillator (LPECO). This function should
* be called after \ref Cy_SysClk_LpEcoConfigure.
*
* \param timeoutus Amount of time in microseconds to wait for the LPECO to stabilize.
* To avoid waiting for stabilization, set this parameter to 0.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - ECO locked \n
* CY_SYSCLK_TIMEOUT - ECO timed out and did not lock \n
* CY_SYSCLK_INVALID_STATE - ECO already enabled
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 or CLK_HF1 frequency.
*
* \note
* This API is available for TVIIC devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_LpEcoEnable
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_LpEcoEnable(uint32_t timeoutus);

/*******************************************************************************
* Function Name: Cy_SysClk_LpEcoDisable
****************************************************************************//**
*
* Disables the low-power external crystal oscillator (LPECO). This function
* should not be called if the LPECO is sourcing clkHf[0] or clkHf[1].
*
* \note
* This API is available for TVIIC devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_LpEcoDisable
*
*******************************************************************************/
void Cy_SysClk_LpEcoDisable(void);

/*******************************************************************************
* Function Name: Cy_SysClk_LpEcoSetFrequency
****************************************************************************//**
*
* Stores the low-power external crystal oscillator (LPECO) frequency in a global
* variable within Sysclk driver.
*
* \param freq Operating frequency of the crystal in Hz.
* Valid range: 3990000...8010000 (3.99..8.01 MHz).
*
* \note
* This API is available for TVIIC devices.
*
*******************************************************************************/
void Cy_SysClk_LpEcoSetFrequency(uint32_t freq);

/*******************************************************************************
* Function Name: Cy_SysClk_LpEcoGetFrequency
****************************************************************************//**
*
* Returns the frequency of the low-power external crystal oscillator (LPECO).
*
* \return The frequency of the LPECO in Hz.
*
* \note If the LPECO is not enabled or stable - a zero is returned.
*
* \note
* This API is available for TVIIC devices.
*
*******************************************************************************/
uint32_t Cy_SysClk_LpEcoGetFrequency(void);

/*******************************************************************************
* Function Name: Cy_SysClk_LpEcoPrescaleConfigure
****************************************************************************//**
*
* Configures the low-power external crystal oscillator (LPECO) Prescaler
* and derives clk_lpeco_prescaler
*
* \param enable LPECO Prescaler enable/disable.
*
* \param int_div 10-bit integer value. Subtract one from the desired divide value
* when using this parameter. For example , to divide by 1, int_div should be set
* to 0.
*
* \param frac_div 8-bit fraction value.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - LPECO prescaler configuration completed successfully \n
* CY_SYSCLK_BAD_PARAM - One or more invalid parameters \n
* CY_SYSCLK_INVALID_STATE - LPECO already enabled
*
* \note
* This API is available for TVIIC devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_LpEcoPrescaleConfigure
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_LpEcoPrescaleConfigure(bool enable, uint32_t int_div, uint32_t frac_div);

/*******************************************************************************
* Function Name: Cy_SysClk_LpEcoPrescaleIsEnabled
****************************************************************************//**
*
* Reports whether or not LPECO Prescale is enabled.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available for TVIIC devices.
*
*******************************************************************************/
bool Cy_SysClk_LpEcoPrescaleIsEnabled(void);

/*******************************************************************************
* Function Name: Cy_SysClk_LpEcoAmplitudeOkay
****************************************************************************//**
*
* Reports the current status of the low-power external crystal oscillator (LPECO)
* amplitude detection.
*
* \return
* false = Insufficient oscillation amplitude OR the amplitude detector is off \n
* true = Sufficient oscillation amplitude is detected
*
* \note
* This API is available for TVIIC devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_LpEcoAmplitudeOkay
*
*******************************************************************************/
bool Cy_SysClk_LpEcoAmplitudeOkay(void);

