zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
    uint32_t                        kiFrac;        /**< CONFIG5 register, Gain of P/I loop filter proportional path for FRACT operation only for CAT1D devices */
    uint32_t                        kpFrac;        /**< CONFIG5 register, Gain of P/I loop filter integrator path for FRACT operation. only for CAT1D devices */
    uint32_t                        kiAccFrac;    /**< CONFIG6 register, KI_ACC_FRACT bits, only for CAT1B(B2), devices */
    uint32_t                        kpAccFrac;    /**< CONFIG7 register, KP_ACC_FRACT bits, only for CAT1B(B2), devices */
    uint32_t                        pwrupAccFrac;      /**< CONFIG5 register, PWRUP_ACC_INT bits, only for CAT1D, SRSS_1_1 */

    uint32_t                        kiSscg;        /**< CONFIG5 register, Gain of P/I loop filter proportional path for SSCG operation only for CAT1D devices */
    uint32_t                        kpSscg;        /**< CONFIG5 register, Gain of P/I loop filter integrator path for SSCG operation. only for CAT1D devices */
    uint32_t                        kiAccSscg;     /**< CONFIG7 register, KI_ACC_SSCG bits, only for CAT1B(B2), devices */
    uint32_t                        kpAccSscg;     /**< CONFIG7 register, KP_ACC_SSCG bits, only for CAT1B(B2), devices */
    uint32_t                        pwrupAccSscg;     /**< CONFIG7 register, KP_ACC_SSCG bits, only for CAT1B(B2), devices */
#else
    uint32_t                        dcoCode;       /**< CONFIG4 register, DCO_CODE bits, only for CAT1B(B2), devices */
    uint32_t                        accMode;       /**< CONFIG4 register, ACC_MODE bits, only for CAT1B(B2), devices */
    uint32_t                        tdcMode;       /**< CONFIG4 register, TDC_MODE bits, only for CAT1B(B2), devices */
    uint32_t                        pllTg;         /**< CONFIG4 register, PLL_TG bits, only for CAT1B(B2), devices */
    bool                            accCntLock;    /**< CONFIG4 register, ACC_CNT_LOCK bits, only for CAT1B(B2), devices */
    uint32_t                        kiInt;         /**< CONFIG5 register, KI_INT bits, only for CAT1B(B2), devices */
    uint32_t                        kpInt;         /**< CONFIG5 register, KP_INT bits, only for CAT1B(B2), devices */
    uint32_t                        kiAccInt;      /**< CONFIG5 register, KI_ACC_INT bits, only for CAT1B(B2), devices */
    uint32_t                        kpAccInt;      /**< CONFIG5 register, KP_ACC_INT bits, only for CAT1B(B2), devices */
    uint32_t                        kiFrac;       /**< CONFIG6 register, KI_FRACT bits, only for CAT1B(B2), devices */
    uint32_t                        kpFrac;       /**< CONFIG6 register, KP_FRACT bits, only for CAT1B(B2), devices */
    uint32_t                        kiAccFrac;    /**< CONFIG6 register, KI_ACC_FRACT bits, only for CAT1B(B2), devices */
    uint32_t                        kpAccFrac;    /**< CONFIG7 register, KP_ACC_FRACT bits, only for CAT1B(B2), devices */
    uint32_t                        kiSscg;        /**< CONFIG7 register, KI_SSCG bits, only for CAT1B(B2), devices */
    uint32_t                        kpSscg;        /**< CONFIG7 register, KP_SSCG bits, only for CAT1B(B2), devices */
    uint32_t                        kiAccSscg;     /**< CONFIG7 register, KI_ACC_SSCG bits, only for CAT1B(B2), devices */
    uint32_t                        kpAccSscg;     /**< CONFIG7 register, KP_ACC_SSCG bits, only for CAT1B(B2), devices */
#endif
} cy_stc_dpll_lp_config_t;

#if defined (CY_IP_MXS22SRSS)  || defined(CY_DOXYGEN)
/** DPLL-HP wait mode selection enum.
* See CONFIG2 register, bits MODE_SEL.
*/
typedef enum
{
    CY_SYSCLK_DPLL_HP_CLK4MHZ_1US_CNT_VAL     = 0U, /**< clk_dig frequency = 4MHz*/
    CY_SYSCLK_DPLL_HP_CLK10MHZ_1US_CNT_VAL    = 1U, /**< clk_dig frequency = 10MHz*/
    CY_SYSCLK_DPLL_HP_CLK15MHZ_1US_CNT_VAL    = 2U, /**< clk_dig frequency = 15MHz*/
    CY_SYSCLK_DPLL_HP_CLK20MHZ_1US_CNT_VAL    = 3U, /**< clk_dig frequency = 20MHz*/
    CY_SYSCLK_DPLL_HP_CLK30MHZ_1US_CNT_VAL    = 4U, /**< clk_dig frequency = 30MHz*/
    CY_SYSCLK_DPLL_HP_CLK40MHZ_1US_CNT_VAL    = 5U, /**< clk_dig frequency = 40MHz*/
    CY_SYSCLK_DPLL_HP_CLK45MHZ_1US_CNT_VAL    = 6U, /**< clk_dig frequency = 45MHz*/
    CY_SYSCLK_DPLL_HP_CLK50MHZ_1US_CNT_VAL    = 7U  /**< clk_dig frequency = 50MHz*/
} cy_en_wait_mode_select_t;


/** Structure containing information for configuration of a DPLL-HP.
*/
/**
* \note
* This structure is available only for CAT1D devices.
**/
typedef struct
{
    uint8_t                         nDiv;          /**< CONFIG register, NDIV bits, Ratio between DCO frequency and reference frequency */
    uint8_t                         pDiv;          /**< CONFIG register, PDIV bits, Pre-Divider for scaling the reference frequency */
    uint8_t                         kDiv;          /**< CONFIG register, KDIV bits, Post-Divider */
    cy_en_fll_pll_output_mode_t     outputMode;    /**< CONFIG register, BYPASS_SEL bits */
    bool                            pllEn;         /**< CONFIG register, ENABLE bits, Master Enable for PLL */

    uint32_t                        nDivFract;     /**< CONFIG2 register, NDIV_FRACT bits, N-divider division factor */
    cy_en_wait_mode_select_t        freqModeSel;   /**< CONFIG2 register, MODE_SEL bits, Selects the waiting time for Power Initialization sequence */
    uint8_t                         ivrTrim  ;     /**< CONFIG2 register, IVR_TRIM bits, Trim value for the Regulated Voltage */

    bool                            clkrSel;       /**< CONFIG3 register, CLKR_SEL bit, Select re-timed reference clock */
    bool                            fdsmSel;       /**< CONFIG3 register, FDSM_SEL bit, DSM clock division select, true - div_by_2, false - div_by_4 */

    uint8_t                         alphaCoarse;   /**< CONFIG4 register, LF_LC_ALPHA bits, Alpha value of the coarse filter */
    uint8_t                         betaCoarse;    /**< CONFIG4 register, LF_LC_BETA bits, Beta value of the coarse filter */
    uint8_t                         flockThresh;   /**< CONFIG4 register, FLOCK_EN_THRESH bits, PQDIFF threshold under which FINE Filtering gets enabled */
    uint8_t                         flockWait;     /**< CONFIG4 register, FLOCK_WAITPER bits, Period over which flock_en_thresh must be met in order for FINE Filtering enabling */
    uint8_t                         flockLkThres;  /**< CONFIG4 register, FLOCK_LK_THRESH bits, PQDIFF threshold under which DLL asserts Freq LOCK */
    uint8_t                         flockLkWait;   /**< CONFIG4 register, FLOCK_LK_WAITPER bits, Period over which flock_en_thresh must be met in order for Freq Locking */
    uint8_t                         flockObs;      /**< CONFIG4 register, FLOCK_OBSWIN bits, Period over which PQDIFF is computed/observed */

    uint8_t                         alphaExt;      /**< CONFIG5 register, LF_ALPHA bits, External Alpha value */
    uint8_t                         betaExt;       /**< CONFIG5 register, LF_BETA bits, External Beta value */
    bool                            lfEn;          /**< CONFIG5 register, LF_SET_PARAMS bit, enable for external loop filter control (alpha and beta values) */
    uint16_t                        dtCal;         /**< CONFIG5 register, DUTY CAL circuit status */

