zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_DpllLpManualConfigure
****************************************************************************//**
*
* Manually configures a DPLL-LP based on user inputs.
*
* \param pllNum Selects which DPLL-LP to configure.
*
* \param config \ref cy_stc_pll_manual_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully configured \n
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call this function after changing the PLL input frequency; for example if
* \ref Cy_SysClk_ClkPathSetSource() is called.
*
* \note
* Do not call this function when the PLL is enabled. If it is called, then this function
* returns immediately with an error return value and no register updates.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllLpManualConfigure(uint32_t pllNum, const cy_stc_pll_manual_config_t *config);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllLpGetConfiguration
****************************************************************************//**
*
* Reports configuration settings for DPLL-LP.
*
* \param pllNum Selects which DPLL-LP to report.
*
* \param config \ref cy_stc_pll_manual_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL data successfully reported \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllLpGetConfiguration(uint32_t pllNum, cy_stc_pll_manual_config_t *config);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllLpEnable
****************************************************************************//**
*
* Enables the DPLL-LP. The PLL should be configured before calling this function.
*
* \param pllNum Selects which DPLL-LP to enable.
*
* \param timeoutus amount of time in microseconds to wait for the PLL to lock.
* If the lock doesn't occur, PLL is stopped. To avoid waiting for lock, set this to 0
* and manually check for lock using \ref Cy_SysClk_PllLocked.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully enabled \n
* CY_SYSCLK_TIMEOUT - Timeout waiting for PLL lock \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllLpEnable(uint32_t pllNum, uint32_t timeoutus);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllLpIsEnabled
****************************************************************************//**
*
* Reports whether or not the selected DPLL-LP is enabled.
*
* \param pllNum Selects which DPLL-LP to check.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
bool Cy_SysClk_DpllLpIsEnabled(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllLpLocked
****************************************************************************//**
*
* Reports whether or not the selected DPLL-LP is locked.
*
* \param pllNum Selects which DPLL-LP to check.
*
* \return
* false = not locked \n
* true = locked
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
bool Cy_SysClk_DpllLpLocked(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllLpLostLock
****************************************************************************//**
*
* Reports whether or not the selected DPLL-LP lost its lock since the last time this
* function was called. Clears the lost lock indicator.
*
* \param pllNum Selects which DPLL-LP to check.
*
* \return
* false = did not lose lock \n
* true = lost lock
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
bool Cy_SysClk_DpllLpLostLock(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllLpDisable
****************************************************************************//**
*
* Disables the selected DPLL-LP.
*
* \param pllNum Selects which DPLL-LP to disable.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully disabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \sideeffect
* This function sets PLL bypass mode to CY_SYSCLK_FLLPLL_OUTPUT_INPUT.
* If AUTO mode should be used, call \ref Cy_SysClk_DpllLpConfigure or
* \ref Cy_SysClk_DpllLpManualConfigure before calling \ref Cy_SysClk_DpllLpEnable.
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllLpDisable(uint32_t pllNum);

