zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_DpllLpGetFrequency
****************************************************************************//**
*
* Gets the frequency of DPLL-LP
*
* \param pllNum Selects which DPLL-LP to check.
*
* \return
* DPLL-LP Frequency
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
uint32_t Cy_SysClk_DpllLpGetFrequency(uint32_t pllNum);

#if defined(CY_IP_MXS22SRSS) || defined(CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpConfigure
****************************************************************************//**
*
* Configures DPLL-HP.
*
* The configuration formula used is:
*   Fout = (pll_clk * NDIV) / (PDIV * KDIV), where:
*     Fout is the desired output frequency
*     pll_clk is the frequency of the input source
*     NDIV is the Ratio between DCO frequency and reference frequency.
*     PDIV is the reference divider.
*     KDIV is the post divider.
*
* \param pllNum Selects which DPLL-HP to configure
*
* \param config \ref cy_stc_pll_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully configured \n
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_BAD_PARAM - Invalid clock path number, or input or desired output frequency is out of valid range \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call this function after changing the PLL input frequency, for example if
* \ref Cy_SysClk_ClkPathSetSource() is called.
*
* \note
* Do not call this function when the PLL is enabled. If it is called, then this function
* returns immediately with an error return value and no register updates.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllHpConfigure(uint32_t pllNum, const cy_stc_pll_config_t *config);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpManualConfigure
****************************************************************************//**
*
* Manually configures a DPLL-HP based on user inputs.
*
* \param pllNum Selects which DPLL-HP to configure.
*
* \param config \ref cy_stc_pll_manual_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully configured \n
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call this function after changing the PLL input frequency; for example if
* \ref Cy_SysClk_ClkPathSetSource() is called.
*
* \note
* Do not call this function when the PLL is enabled. If it is called, then this function
* returns immediately with an error return value and no register updates.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllHpManualConfigure(uint32_t pllNum, const cy_stc_pll_manual_config_t *config);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpGetConfiguration
****************************************************************************//**
*
* Reports configuration settings for DPLL-HP.
*
* \param pllNum Selects which DPLL-HP to report.
*
* \param config \ref cy_stc_pll_manual_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL data successfully reported \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllHpGetConfiguration(uint32_t pllNum, cy_stc_pll_manual_config_t *config);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpEnable
****************************************************************************//**
*
* Enables the DPLL-HP. The PLL should be configured before calling this function.
*
* \param pllNum Selects which DPLL-HP to enable.
*
* \param timeoutus amount of time in microseconds to wait for the PLL to lock.
* If the lock doesn't occur, PLL is stopped. To avoid waiting for lock, set this to 0
* and manually check for lock using \ref Cy_SysClk_PllLocked.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully enabled \n
* CY_SYSCLK_TIMEOUT - Timeout waiting for PLL lock \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllHpEnable(uint32_t pllNum, uint32_t timeoutus);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpIsEnabled
****************************************************************************//**
*
* Reports whether or not the selected DPLL-HP is enabled.
*
* \param pllNum Selects which DPLL-HP to check.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
bool Cy_SysClk_DpllHpIsEnabled(uint32_t pllNum);


