zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpLocked
****************************************************************************//**
*
* Reports whether or not the selected DPLL-HP is locked.
*
* \param pllNum Selects which DPLL-HP to check.
*
* \return
* false = not locked \n
* true = locked
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
bool Cy_SysClk_DpllHpLocked(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpLostLock
****************************************************************************//**
*
* Reports whether or not the selected DPLL-HP lost its lock since the last time this
* function was called. Clears the lost lock indicator.
*
* \param pllNum Selects which DPLL-HP to check.
*
* \return
* false = did not lose lock \n
* true = lost lock
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
bool Cy_SysClk_DpllHpLostLock(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpDisable
****************************************************************************//**
*
* Disables the selected DPLL-HP.
*
* \param pllNum Selects which DPLL-HP to disable.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully disabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \sideeffect
* This function sets PLL bypass mode to CY_SYSCLK_FLLPLL_OUTPUT_INPUT.
* If AUTO mode should be used, call \ref Cy_SysClk_DpllHpConfigure or
* \ref Cy_SysClk_DpllHpManualConfigure before calling \ref Cy_SysClk_DpllHpEnable.
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_DpllHpDisable(uint32_t pllNum);

/*******************************************************************************
* Function Name: Cy_SysClk_DpllHpGetFrequency
****************************************************************************//**
*
* Gets the frequency of DPLL-HP
*
* \param pllNum Selects which DPLL-HP to check.
*
* \return
* DPLL-LP Frequency
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
uint32_t Cy_SysClk_DpllHpGetFrequency(uint32_t pllNum);

#endif
#endif

#if defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)

/********************************************************************************
* Function Name: Cy_SysClk_Pll200MConfigure
****************************************************************************//**
*
* Configures 200M PLL.
* The configuration formula used is:
*   Fout = pll_clk * (P / Q / div_out), where:
*     Fout is the desired output frequency
*     pll_clk is the frequency of the input source
*     P is the feedback divider. Its value is in bitfield FEEDBACK_DIV.
*     Q is the reference divider. Its value is in bitfield REFERENCE_DIV.
*     div_out is the reference divider. Its value is in bitfield OUTPUT_DIV.
*
* \param pllNum Selects which PLL to configure
*
* \param config \ref cy_stc_pll_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully configured \n
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_BAD_PARAM - Invalid clock path number, or input or desired output frequency is out of valid range \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call this function after changing the PLL input frequency, for example if
* \ref Cy_SysClk_ClkPathSetSource() is called.
*
* \note
* Do not call this function when the PLL is enabled. If it is called, then this function
* returns immediately with an error return value and no register updates.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is decreasing.
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_Pll200MConfigure(uint32_t pllNum, const cy_stc_pll_config_t *config);


/*******************************************************************************
* Function Name: Cy_SysClk_Pll200MManualConfigure
****************************************************************************//**
*
* Manually configures a 200M PLL based on user inputs.
*
* \param pllNum Selects which PLL to configure.
*
* \param config \ref cy_stc_pll_manual_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully configured \n
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
* For the PSoC 64 devices there are possible situations when function returns
* the PRA error status code. This is because for PSoC 64 devices the function
* uses the PRA driver to change the protected registers. Refer to
* \ref cy_en_pra_status_t for more details.
*
* \note
* Call this function after changing the PLL input frequency; for example if
* \ref Cy_SysClk_ClkPathSetSource() is called.
*
* \note
* Do not call this function when the PLL is enabled. If it is called, then this function
* returns immediately with an error return value and no register updates.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is decreasing.
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_Pll200MManualConfigure(uint32_t pllNum, const cy_stc_pll_manual_config_t *config);


