zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_Pll200MGetConfiguration
****************************************************************************//**
*
* Reports configuration settings for 200M PLL.
*
* \param pllNum Selects which PLL to report.
*
* \param config \ref cy_stc_pll_manual_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL data successfully reported \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_Pll200MGetConfiguration(uint32_t pllNum, cy_stc_pll_manual_config_t *config);


/*******************************************************************************
* Function Name: Cy_SysClk_Pll200MEnable
****************************************************************************//**
*
* Enables the 200M PLL. The PLL should be configured before calling this function.
*
* \param pllNum Selects which PLL to enable.
*
* \param timeoutus amount of time in microseconds to wait for the PLL to lock.
* If the lock doesn't occur, PLL is stopped. To avoid waiting for lock, set this to 0
* and manually check for lock using \ref Cy_SysClk_PllLocked.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully enabled \n
* CY_SYSCLK_TIMEOUT - Timeout waiting for PLL lock \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* the PLL is the source of CLK_HF0 and the CLK_HF0 frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* the PLL is the source of CLK_HF0 and the CLK_HF0 frequency is decreasing.
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_Pll200MEnable(uint32_t pllNum, uint32_t timeoutus);


/*******************************************************************************
* Function Name: Cy_SysClk_Pll200MIsEnabled
****************************************************************************//**
*
* Reports whether or not the selected 200M PLL is enabled.
*
* \param pllNum Selects which PLL to check.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
bool Cy_SysClk_Pll200MIsEnabled(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_Pll200MLocked
****************************************************************************//**
*
* Reports whether or not the selected 200M PLL is locked.
*
* \param pllNum Selects which PLL to check.
*
* \return
* false = not locked \n
* true = locked
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
bool Cy_SysClk_Pll200MLocked(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_Pll200MLostLock
****************************************************************************//**
*
* Reports whether or not the selected 200M PLL lost its lock since the last time this
* function was called. Clears the lost lock indicator.
*
* \param pllNum Selects which PLL to check.
*
* \return
* false = did not lose lock \n
* true = lost lock
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
bool Cy_SysClk_Pll200MLostLock(uint32_t pllNum);


/*******************************************************************************
* Function Name: Cy_SysClk_Pll200MDisable
****************************************************************************//**
*
* Disables the selected 200M PLL.
*
* \param pllNum Selects which PLL to disable.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully disabled \n
* CY_SYSCLK_BAD_PARAM - invalid clock path number
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* the PLL is the source of CLK_HF0 and the CLK_HF0 frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* the PLL is the source of CLK_HF0 and the CLK_HF0 frequency is decreasing.
*
* \sideeffect
* This function sets PLL bypass mode to CY_SYSCLK_FLLPLL_OUTPUT_INPUT.
* If AUTO mode should be used, call \ref Cy_SysClk_PllConfigure or
* \ref Cy_SysClk_PllManualConfigure before calling \ref Cy_SysClk_PllEnable.
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_Pll200MDisable(uint32_t pllNum);

/*******************************************************************************
* Function Name: Cy_SysClk_Pll200MGetFrequency
****************************************************************************//**
*
* Gets the frequency of PLL200M
*
* \param pllNum Selects which PLL to check.
*
* \return
* PLL200M Frequency
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
uint32_t Cy_SysClk_Pll200MGetFrequency(uint32_t pllNum);

/* Only include PLL400M functions for devices that can support it. */
#if defined (CY_SRSS_PLL400M_PRESENT) && (CY_SRSS_PLL400M_PRESENT == 1u) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysClk_Pll400MConfigure
****************************************************************************//**
*
* Configures 400M PLL.
* The configuration formula used is:
*   Fout = pll_clk * (P / Q / div_out), where:
*     Fout is the desired output frequency
*     pll_clk is the frequency of the input source
*     P is the feedback divider. Its value is in bitfield FEEDBACK_DIV.
*     Q is the reference divider. Its value is in bitfield REFERENCE_DIV.
*     div_out is the reference divider. Its value is in bitfield OUTPUT_DIV.
*
* \param pllNum Selects which PLL to configure
*
* \param config \ref cy_stc_pll_config_t
*
* \return  Error / status code: \n
* CY_SYSCLK_SUCCESS - PLL successfully configured \n
* CY_SYSCLK_INVALID_STATE - PLL not configured because it is already enabled \n
* CY_SYSCLK_BAD_PARAM - Invalid clock path number, or input or desired output frequency is out of valid range \n
* CY_SYSCLK_UNSUPPORTED_STATE - PLL is not present
*
* \note
* Call this function after changing the PLL input frequency, for example if
* \ref Cy_SysClk_ClkPathSetSource() is called.
*
* \note
* Do not call this function when the PLL is enabled. If it is called, then this function
* returns immediately with an error return value and no register updates.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* the PLL is the source of CLK_HF0 and the PLL frequency is decreasing.
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_Pll400MConfigure(uint32_t pllNum, const cy_stc_pll_config_t *config);


