zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_Pll400MGetFrequency
****************************************************************************//**
*
* Gets the frequency of PLL400M
*
* \param pllNum Selects which PLL to check.
*
* \return
* PLL400M Frequency
*
* \note
* This API is available only for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
uint32_t Cy_SysClk_Pll400MGetFrequency(uint32_t pllNum);
#endif  /* defined (CY_SRSS_PLL400M_PRESENT) && (CY_SRSS_PLL400M_PRESENT == 1u) */

#endif  /* defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2) */

/** \} group_sysclk_pll_funcs */

#endif


#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
/* ========================================================================== */
/* ===========================    IHO SECTION    ============================ */
/* ========================================================================== */

/**
* \addtogroup group_sysclk_iho_funcs
* \{
*/

#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)

/*******************************************************************************
* Function Name: Cy_SysClk_IhoEnable
****************************************************************************//**
*
* Enables the IHO.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available for CAT1B and CAT1D.
*
* \note
* Take into account the possible platform specific clkHf (and further
* clocking chain links) frequency limitations while using this API.
*
*******************************************************************************/
void Cy_SysClk_IhoEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IhoIsEnabled
****************************************************************************//**
*
* Reports whether or not the selected IHO is enabled.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available for CAT1B and CAT1D.
*
*******************************************************************************/
bool Cy_SysClk_IhoIsEnabled(void);

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDisable
****************************************************************************//**
*
* Disables IHO.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available for CAT1B and CAT1D.
*
*******************************************************************************/
void Cy_SysClk_IhoDisable(void);

#endif

#if defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDeepsleepEnable
****************************************************************************//**
*
* Enables the IHO during deepsleep mode
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS(CAT1D) IP.
*
*******************************************************************************/
void Cy_SysClk_IhoDeepsleepEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IhoIsDeepsleepEnabled
****************************************************************************//**
*
* Reports whether or not the selected IHO is enabled during deepsleep mode.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS(CAT1D) IP.
*
*******************************************************************************/
bool Cy_SysClk_IhoIsDeepsleepEnabled(void);

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDeepsleepDisable
****************************************************************************//**
*
* Disables IHO during deepsleep mode.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling
* if it affects the CLK_HF0 frequency.
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS(CAT1D) IP.
*
*******************************************************************************/
void Cy_SysClk_IhoDeepsleepDisable(void);

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDeepsleepDisable
****************************************************************************//**
*
* Set the trim value for IHO.
*
* \param trimVal Trim value to be set for IHO.
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS(CAT1D) IP.
*
*******************************************************************************/
void Cy_SysClk_IhoSetTrim(uint32_t trimVal);

/*******************************************************************************
* Function Name: Cy_SysClk_IhoDeepsleepDisable
****************************************************************************//**
*
* Get the trim value configured for IHO.
*
* \return
* Configured IHO Trim value.
*
* \note
* This API is available for devices having CY_IP_MXS22SRSS(CAT1D) IP.
*
*******************************************************************************/
uint32_t Cy_SysClk_IhoGetTrim(void);


#endif/* CY_IP_MXS22SRSS*/

/** \} group_sysclk_iho_funcs */
#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)*/

/* ========================================================================== */
/* ===========================    IMO SECTION    ============================ */
/* ========================================================================== */

/**
* \addtogroup group_sysclk_imo_funcs
* \{
*/
#if defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2))

