zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ImoEnable
****************************************************************************//**
*
* Enables the IMO.
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B and CAT1C devices.
*
*******************************************************************************/
void Cy_SysClk_ImoEnable(void);

/*******************************************************************************
* Function Name: Cy_SysClk_ImoIsEnabled
****************************************************************************//**
*
* Reports whether or not the selected IMO is enabled.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B and CAT1C devices.
*
*******************************************************************************/
bool Cy_SysClk_ImoIsEnabled(void);

/*******************************************************************************
* Function Name: Cy_SysClk_ImoDisable
****************************************************************************//**
*
* Disables IMO.
*
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B and CAT1C devices.
*
*******************************************************************************/
void Cy_SysClk_ImoDisable(void);
#endif /* defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) */

#if defined (CY_IP_MXS40SSRSS)

/*******************************************************************************
* Function Name: Cy_SysClk_ImoDeepsleepEnable
****************************************************************************//**
*
* Enables the IMO during deepsleep mode
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysClk_ImoDeepsleepEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ImoIsDeepsleepEnabled
****************************************************************************//**
*
* Reports whether or not the selected IMO is enabled during deepsleep mode.
*
* \return
* false = disabled \n
* true = enabled
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
bool Cy_SysClk_ImoIsDeepsleepEnabled(void);

/*******************************************************************************
* Function Name: Cy_SysClk_ImoDeepsleepDisable
****************************************************************************//**
*
* Disables IMO during deepsleep mode.
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysClk_ImoDeepsleepDisable(void);
#endif /* defined (CY_IP_MXS40SSRSS) */
/** \} group_sysclk_imo_funcs */

/* ========================================================================== */
/* ===========================    ILO SECTION    ============================ */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_ilo_funcs
* \{
*/

#if defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysClk_IloEnable
****************************************************************************//**
*
* Enables the ILO.
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_IloEnable
*
* \note
* This API is available for CAT1A (excluding TVIIBE) and CAT1B devices.
*
*******************************************************************************/
void Cy_SysClk_IloEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IloIsEnabled
****************************************************************************//**
*
* Reports the Enabled/Disabled status of the ILO.
*
* \return Boolean status of ILO: true - Enabled, false - Disabled.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_IloDisable
*
* \note
* This API is available for CAT1A (excluding TVIIBE) and CAT1B devices.
*
*******************************************************************************/
bool Cy_SysClk_IloIsEnabled(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IloDisable
****************************************************************************//**
*
* Disables the ILO. ILO can't be disabled if WDT is enabled.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - ILO successfully disabled \n
* CY_SYSCLK_INVALID_STATE - Cannot disable the ILO if the WDT is enabled.
* CY_PRA_STATUS_* - For the PSoC 64 devices there are possible situations when
* function returns the PRA error status code \ref cy_en_pra_status_t instead of
* \ref cy_en_sysclk_status_t. This is because for PSoC 64 devices the function
* uses the PRA driver to change the protected registers. Refer to
* \ref cy_en_pra_status_t for more details.
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
* Do not call this function if the WDT is enabled, because the WDT is clocked by
* the ILO.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_IloDisable
*
* \note
* This API is available for CAT1A (excluding TVIIBE) and CAT1B devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_IloDisable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IloHibernateOn
****************************************************************************//**
*
* Controls whether the ILO stays on during a hibernate, or through an XRES or
* brown-out detect (BOD) event.
*
* \param on
* true = ILO stays on during hibernate or across XRES/BOD. \n
* false = ILO turns off for hibernate or XRES/BOD.
*
* \note Writes to the register/bit are ignored if the watchdog (WDT) is locked.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_IloHibernateOn
*
* \note
* This API is available for CAT1A (excluding TVIIBE) and CAT1B devices.
*
*******************************************************************************/
void Cy_SysClk_IloHibernateOn(bool on);
#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_DOXYGEN)  */

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysClk_IloSrcEnable
****************************************************************************//**
*
* Enables the ILO.
*
* \param iloNum - ILO index , 0 : ILO0, 1: ILO1
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_IloSrcEnable
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
*
* \note
* This API is available for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
void Cy_SysClk_IloSrcEnable(uint32_t iloNum);


