zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_IloSrcIsEnabled
****************************************************************************//**
*
* Reports the Enabled/Disabled status of the ILO.
*
* \param iloNum - ILO index , ILO0 or ILO1
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_IloSrcIsEnabled
*
* \return Boolean status of ILO: true - Enabled, false - Disabled.
*
* \note
* This API is available for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
bool Cy_SysClk_IloSrcIsEnabled(uint32_t iloNum);


/*******************************************************************************
* Function Name: Cy_SysClk_IloSrcDisable
****************************************************************************//**
*
* Disables the ILO. ILO can't be disabled if WDT is enabled.
*
* \param iloNum - ILO index , 0 : ILO0, 1: ILO1
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_IloSrcDisable
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - ILO successfully disabled \n
* CY_SYSCLK_INVALID_STATE - Cannot disable the ILO if the WDT is enabled.
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
* Do not call this function if the WDT is enabled, because the WDT is clocked by
* the ILO.
*
* \note
* This API is available for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_IloSrcDisable(uint32_t iloNum);


/*******************************************************************************
* Function Name: Cy_SysClk_IloSrcHibernateOn
****************************************************************************//**
*
* Controls whether the ILO0 stays on during a hibernate, or through an XRES or
* brown-out detect (BOD) event, this feature is not available for ILO1.
*
* \param iloNum - ILO index , 0 : ILO0, 1: ILO1(Feature not available, ignored)
*
* \param on
* true = ILO stays on during hibernate or across XRES/BOD. \n
* false = ILO turns off for hibernate or XRES/BOD.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_IloSrcHibernateOn
*
* \note Writes to the register/bit are ignored if the watchdog (WDT) is locked.
*
* \note
* This API is available for CAT1A (TVIIBE only) and CAT1C devices.
*
*******************************************************************************/
void Cy_SysClk_IloSrcHibernateOn(uint32_t iloNum, bool on);

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 2)) */

/** \} group_sysclk_ilo_funcs */


/* ========================================================================== */
/* ===========================    PILO SECTION    =========================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_pilo_funcs
* \{
*/

/*******************************************************************************
* Function Name: Cy_SysClk_PiloEnable
****************************************************************************//**
*
* Enables the PILO.
*
* \note This function blocks for 1 millisecond between enabling the PILO and
* releasing the PILO reset.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PiloEnable
*
*******************************************************************************/
void Cy_SysClk_PiloEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_PiloIsEnabled
****************************************************************************//**
*
* Reports the Enabled/Disabled status of the PILO.
*
* \return Boolean status of PILO: true - Enabled, false - Disabled.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PiloDisable
*
*******************************************************************************/
bool Cy_SysClk_PiloIsEnabled(void);


/*******************************************************************************
* Function Name: Cy_SysClk_PiloDisable
****************************************************************************//**
*
* Disables the PILO.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PiloDisable
*
*******************************************************************************/
void Cy_SysClk_PiloDisable(void);

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysClk_PiloSetTrim
****************************************************************************//**
*
* Sets the PILO trim bits, which adjusts the PILO frequency. This is typically
* done after measuring the PILO frequency; see \ref Cy_SysClk_StartClkMeasurementCounters().
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PiloSetTrim
*
*******************************************************************************/
void Cy_SysClk_PiloSetTrim(uint32_t trimVal);


/*******************************************************************************
* Function Name: Cy_SysClk_PiloGetTrim
****************************************************************************//**
*
* Reports the current PILO trim bits value.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_PiloSetTrim
*
*******************************************************************************/
uint32_t Cy_SysClk_PiloGetTrim(void);
#endif /* defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2) */


#if defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysClk_PiloBackupEnable
****************************************************************************//**
*
* Enables the PILO as always on if Backup Domain is present.
*
* \note
* This API is available for CAT1B & CAT1D devices.
*
*******************************************************************************/
void Cy_SysClk_PiloBackupEnable(void);

