zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_PiloBackupDisable
****************************************************************************//**
*
* Disables the PILO as always on if Backup Domain is present.
*
* \note
* This API is available for CAT1B & CAT1D devices.
*
*******************************************************************************/
void Cy_SysClk_PiloBackupDisable(void);

/*******************************************************************************
* Function Name: Cy_SysClk_PiloOkay
****************************************************************************//**
*
* Reports the status of the PILO.
*
* \return
* true = okay \n
* false = not okay
*
* \note
* This API is available for CAT1B(20829) devices.
*
*******************************************************************************/
bool Cy_SysClk_PiloOkay(void);

#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN) */

#if defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysClk_PiloTcscEnable
****************************************************************************//**
*
* Enables the PILO TCSC(Second order temperature curvature correction) Feature.
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysClk_PiloTcscEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_PiloTcscDisable
****************************************************************************//**
*
* Disables the PILO TCSC(Second order temperature curvature correction) Feature.
*
* \note
* This API is available for CAT1B devices.
*
*******************************************************************************/
void Cy_SysClk_PiloTcscDisable(void);

#endif /* defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN) */

/** \} group_sysclk_pilo_funcs */


/* ========================================================================== */
/* ==========================    ALTHF SECTION    =========================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_alt_hf_funcs
* \{
*/
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysClk_AltHfGetFrequency
****************************************************************************//**
*
* Reports the frequency of the Alternative High-Frequency Clock
*
* \note
* This API is available for CAT1A (excluding TVIIBE) and CAT1B devices.
*
* \funcusage
* \snippet bleclk/snippet/main.c BLE ECO clock API: Cy_BLE_EcoConfigure()
*
*******************************************************************************/
uint32_t Cy_SysClk_AltHfGetFrequency(void);
#endif

#if defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysClk_AltHfEnable
****************************************************************************//**
*
* Enables the ATLHF.
*
* \note
* This API is available for CAT1B devices.
*
* \return Error / status code: \n
* CY_SYSCLK_SUCCESS - ALTHF successfully disabled \n
* CY_SYSCLK_TIMEOUT - ALTHF enabling failed due to timeout
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_AltHfEnable(uint32_t timeoutus);

/*******************************************************************************
* Function Name: Cy_SysClk_IsAltHfEnabled
****************************************************************************//**
*
* Reports if ALTHF is enabled or not
*
* \note
* This API is available for CAT1B devices.
*
* \return Status of ALTHF \n
* true = Enabled \n
* false = Not Enabled
*
*******************************************************************************/
bool Cy_SysClk_IsAltHfEnabled(void);

#endif /* defined (CY_IP_MXS40SSRSS) */

/** \} group_sysclk_alt_hf_funcs */


/* ========================================================================== */
/* ==========================    ALTLF SECTION    =========================== */
/* ========================================================================== */
/** \cond For future usage */
uint32_t Cy_SysClk_AltLfGetFrequency(void);
bool Cy_SysClk_AltLfIsEnabled(void);
/** \endcond  */


/* ========================================================================== */
/* ====================    CLOCK MEASUREMENT SECTION    ===================== */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_calclk_enums
* \{
*/
/** Defines all possible clock sources */
#if defined(CY_IP_MXS22SRSS)
typedef enum
{
    CY_SYSCLK_MEAS_CLK_NC =                0U,
    CY_SYSCLK_MEAS_CLK_ILO =               1U,
    CY_SYSCLK_MEAS_CLK_WCO =               2U,
    CY_SYSCLK_MEAS_CLK_BAK =               3U,
    CY_SYSCLK_MEAS_CLK_ALTLF =             4U,
    CY_SYSCLK_MEAS_CLK_LFCLK =             5U,
    CY_SYSCLK_MEAS_CLK_IMO =               6U,
    CY_SYSCLK_MEAS_CLK_SLPCTRL =           7U,
    CY_SYSCLK_MEAS_CLK_PILO =              8U,
    CY_SYSCLK_MEAS_CLK_ECO_PRESCALER =     9U,
    CY_SYSCLK_MEAS_CLK_MF =                10U,
    CY_SYSCLK_MEAS_CLK_FAST_CLKS =         0x100U,
    CY_SYSCLK_MEAS_CLK_IHO =               0x101U,
    CY_SYSCLK_MEAS_CLK_EXT =               0x102U,
    CY_SYSCLK_MEAS_CLK_ECO =               0x103U,
    CY_SYSCLK_MEAS_CLK_ALTHF0 =            0x105U,
    CY_SYSCLK_MEAS_CLK_ALTHF1 =            0x106U,
    CY_SYSCLK_MEAS_CLK_TIMERCLK =          0x108U,
    CY_SYSCLK_MEAS_CLK_PATH_CLKS =         0x900U,
    CY_SYSCLK_MEAS_CLK_PATH0 =             0x900U,
    CY_SYSCLK_MEAS_CLK_PATH1 =             0x901U,
    CY_SYSCLK_MEAS_CLK_PATH2 =             0x902U,
    CY_SYSCLK_MEAS_CLK_PATH3 =             0x903U,
    CY_SYSCLK_MEAS_CLK_PATH4 =             0x904U,
    CY_SYSCLK_MEAS_CLK_PATH5 =             0x905U,
    CY_SYSCLK_MEAS_CLK_PATH6 =             0x906U,
    CY_SYSCLK_MEAS_CLK_PATH7 =             0x907U,
    CY_SYSCLK_MEAS_CLK_PATH8 =             0x908U,
    CY_SYSCLK_MEAS_CLK_PATH9 =             0x909U,
    CY_SYSCLK_MEAS_CLK_PATH10 =            0x90AU,
    CY_SYSCLK_MEAS_CLK_PATH11 =            0x90BU,
    CY_SYSCLK_MEAS_CLK_PATH12 =            0x90CU,
    CY_SYSCLK_MEAS_CLK_PATH13 =            0x90DU,
    CY_SYSCLK_MEAS_CLK_PATH14 =            0x90EU,
    CY_SYSCLK_MEAS_CLK_PATH15 =            0x90FU,
    CY_SYSCLK_MEAS_CLK_CLKHFS =            0xA00U,
    CY_SYSCLK_MEAS_CLK_CLKHF0 =            0xA00U,
    CY_SYSCLK_MEAS_CLK_CLKHF1 =            0xA01U,
    CY_SYSCLK_MEAS_CLK_CLKHF2 =            0xA02U,
    CY_SYSCLK_MEAS_CLK_CLKHF3 =            0xA03U,
    CY_SYSCLK_MEAS_CLK_CLKHF4 =            0xA04U,
    CY_SYSCLK_MEAS_CLK_CLKHF5 =            0xA05U,
    CY_SYSCLK_MEAS_CLK_CLKHF6 =            0xA06U,
    CY_SYSCLK_MEAS_CLK_CLKHF7 =            0xA07U,
    CY_SYSCLK_MEAS_CLK_CLKHF8 =            0xA08U,
    CY_SYSCLK_MEAS_CLK_CLKHF9 =            0xA09U,
    CY_SYSCLK_MEAS_CLK_CLKHF10 =           0xA0AU,
    CY_SYSCLK_MEAS_CLK_CLKHF11 =           0xA0BU,
    CY_SYSCLK_MEAS_CLK_CLKHF12 =           0xA0CU,
    CY_SYSCLK_MEAS_CLK_CLKHF13 =           0xA0DU,
    CY_SYSCLK_MEAS_CLK_CLKHF14 =           0xA0EU,
    CY_SYSCLK_MEAS_CLK_CLKHF15 =           0xA0FU,
    CY_SYSCLK_MEAS_CLK_LAST_CLK =          0xA10U
} cy_en_meas_clks_t;
#else
typedef enum
{
    CY_SYSCLK_MEAS_CLK_NC =                0U,
    CY_SYSCLK_MEAS_CLK_ILO =               1U,
    CY_SYSCLK_MEAS_CLK_WCO =               2U,
    CY_SYSCLK_MEAS_CLK_BAK =               3U,
    CY_SYSCLK_MEAS_CLK_ALTLF =             4U,
    CY_SYSCLK_MEAS_CLK_LFCLK =             5U,
    CY_SYSCLK_MEAS_CLK_IMO =               6U,
    CY_SYSCLK_MEAS_CLK_SLPCTRL =           7U,
    CY_SYSCLK_MEAS_CLK_PILO =              8U,
    CY_SYSCLK_MEAS_CLK_ILO1 =              9U,
    CY_SYSCLK_MEAS_CLK_ECO_PRESCALER =     10U,
    CY_SYSCLK_MEAS_CLK_LPECO =             11U,
    CY_SYSCLK_MEAS_CLK_LPECO_PRESCALER =   12U,
    CY_SYSCLK_MEAS_CLK_MFO =               13U,
    CY_SYSCLK_MEAS_CLK_FAST_CLKS =         0x100U,
    CY_SYSCLK_MEAS_CLK_ECO =               0x101U,
    CY_SYSCLK_MEAS_CLK_EXT =               0x102U,
    CY_SYSCLK_MEAS_CLK_ALTHF =             0x103U,
    CY_SYSCLK_MEAS_CLK_TIMERCLK =          0x104U,
    CY_SYSCLK_MEAS_CLK_IHO =               0x108U,
    CY_SYSCLK_MEAS_CLK_PWR =               0x109U,
    CY_SYSCLK_MEAS_CLK_PATH_CLKS =         0x500U,
    CY_SYSCLK_MEAS_CLK_PATH0 =             0x500U,
    CY_SYSCLK_MEAS_CLK_PATH1 =             0x501U,
    CY_SYSCLK_MEAS_CLK_PATH2 =             0x502U,
    CY_SYSCLK_MEAS_CLK_PATH3 =             0x503U,
    CY_SYSCLK_MEAS_CLK_PATH4 =             0x504U,
    CY_SYSCLK_MEAS_CLK_PATH5 =             0x505U,
    CY_SYSCLK_MEAS_CLK_PATH6 =             0x506U,
    CY_SYSCLK_MEAS_CLK_PATH7 =             0x507U,
    CY_SYSCLK_MEAS_CLK_PATH8 =             0x508U,
    CY_SYSCLK_MEAS_CLK_PATH9 =             0x509U,
    CY_SYSCLK_MEAS_CLK_PATH10 =            0x50AU,
    CY_SYSCLK_MEAS_CLK_PATH11 =            0x50BU,
    CY_SYSCLK_MEAS_CLK_PATH12 =            0x50CU,
    CY_SYSCLK_MEAS_CLK_PATH13 =            0x50DU,
    CY_SYSCLK_MEAS_CLK_PATH14 =            0x50EU,
    CY_SYSCLK_MEAS_CLK_PATH15 =            0x50FU,
    CY_SYSCLK_MEAS_CLK_CLKHFS =            0x600U,
    CY_SYSCLK_MEAS_CLK_CLKHF0 =            0x600U,
    CY_SYSCLK_MEAS_CLK_CLKHF1 =            0x601U,
    CY_SYSCLK_MEAS_CLK_CLKHF2 =            0x602U,
    CY_SYSCLK_MEAS_CLK_CLKHF3 =            0x603U,
    CY_SYSCLK_MEAS_CLK_CLKHF4 =            0x604U,
    CY_SYSCLK_MEAS_CLK_CLKHF5 =            0x605U,
    CY_SYSCLK_MEAS_CLK_CLKHF6 =            0x606U,
    CY_SYSCLK_MEAS_CLK_CLKHF7 =            0x607U,
    CY_SYSCLK_MEAS_CLK_CLKHF8 =            0x608U,
    CY_SYSCLK_MEAS_CLK_CLKHF9 =            0x609U,
    CY_SYSCLK_MEAS_CLK_CLKHF10 =           0x60AU,
    CY_SYSCLK_MEAS_CLK_CLKHF11 =           0x60BU,
    CY_SYSCLK_MEAS_CLK_CLKHF12 =           0x60CU,
    CY_SYSCLK_MEAS_CLK_CLKHF13 =           0x60DU,
    CY_SYSCLK_MEAS_CLK_CLKHF14 =           0x60EU,
    CY_SYSCLK_MEAS_CLK_CLKHF15 =           0x60FU,
    CY_SYSCLK_MEAS_CLK_LAST_CLK =          0x610U
} cy_en_meas_clks_t;
#endif
/** \} group_sysclk_calclk_enums */

/**
* \addtogroup group_sysclk_calclk_structs
* \{
*/
#if (defined(CY_DEVICE_SECURE))
/** PRA structure for Cy_SysClk_StartClkMeasurementCounters function parameters */
typedef struct
{
    cy_en_meas_clks_t clock1;        /**< clock1 */
    uint32_t          count1;        /**< count  */
    cy_en_meas_clks_t clock2;        /**< clock2 */
} cy_stc_pra_start_clk_measurement_t;

