zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfCsvManualConfigure
****************************************************************************//**
*
* Manually configures the clkHf csv based on user inputs.
*
* \param hfConfig Selects the clkHf, reference clock for csv operation.
*
* \param csvConfig Selects the csv configuration required.
*
* \return The frequency in Hz.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkHfCSVConfig
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkHfCsvManualConfigure(const cy_stc_clkhf_csv_hf_config_t * hfConfig, const cy_stc_clkhf_csv_manual_config_t * csvConfig);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfCsvConfigure
****************************************************************************//**
*
* Configures clkhf csv.
*
* The configuration formula used is:
* Lower_limit = Target - Required accuracy/2
* Upper_limit = Target + Required accuracy/2
* Period = Target / (Reference frequency / Monitor frequency)
* Start_time = (Period +3) * (Reference frequency / Monitor frequency) - Upper_limit
*
* \param hfConfig Selects the clkHf, reference clock for csv operation.
*
* \param accuracy Required accuracy.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkHfCSVConfig
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkHfCsvConfigure(const cy_stc_clkhf_csv_hf_config_t * hfConfig, uint32_t accuracy);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfCsvAction
****************************************************************************//**
*
* Configures the action taken when an anomaly is detected on the clkHf.
*
* \param clkHf Selects the clkHf.
*
* \param action Action to be taken when anomaly is detected \ref cy_en_clkhf_csv_action_t
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkHfCSVConfig
*
*******************************************************************************/
void Cy_SysClk_ClkHfCsvAction(uint32_t clkHf, cy_en_clkhf_csv_action_t action);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfCsvEnable
****************************************************************************//**
*
* Enables the csv for the provided clkHf.
*
* \param clkHf Selects the clkHf.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkHfCSVConfig
*
*******************************************************************************/
void Cy_SysClk_ClkHfCsvEnable(uint32_t clkHf);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkHfCsvDisable
****************************************************************************//**
*
* Disables the csv for the provided clkHf.
*
* \param clkHf Selects the clkHf.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkHfCSVConfig
*
*******************************************************************************/
void Cy_SysClk_ClkHfCsvDisable(uint32_t clkHf);


/*******************************************************************************
* Function Name: Cy_SysClk_IsClkHfCsvEnabled
****************************************************************************//**
*
* Returns the enabled status of csv for the provided clkHf.
*
* \param clkHf Selects the clkHf.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkHfCSVConfig
*
*******************************************************************************/
bool Cy_SysClk_IsClkHfCsvEnabled(uint32_t clkHf);

#endif

/** \} group_sysclk_clk_hf_funcs */


/* ========================================================================== */
/* =========================    clk_fast SECTION    ========================= */
/* ========================================================================== */
/**
* \addtogroup group_sysclk_clk_fast_funcs
* \{
*/

#if (defined (CY_IP_MXS40SRSS) && defined (CY_IP_M4CPUSS)) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysClk_ClkFastSetDivider
****************************************************************************//**
*
* Sets the clock divider for the fast clock, which sources the main processor.
* The source of this divider is clkHf[0].
*
* \param divider divider value between 0 and 255.
* Causes integer division of (divider value + 1), or division by 1 to 256.
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* CLK_FAST frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* CLK_FAST frequency is decreasing.
*
* \note
* This API is available only for CAT1A devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkFastSetDivider
*
*******************************************************************************/
void Cy_SysClk_ClkFastSetDivider(uint8_t divider);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkFastGetDivider
****************************************************************************//**
*
* Returns the clock divider for the fast clock.
*
* \return The divider value for the fast clock.
* The integer division done is by (divider value + 1), or division by 1 to 256.
*
* \note
* This API is available only for CAT1A devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkFastSetDivider
*
*******************************************************************************/
uint8_t Cy_SysClk_ClkFastGetDivider(void);


