zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ClkFastGetFrequency
****************************************************************************//**
*
* Reports the frequency of the fast clock.
*
* \return The frequency, in Hz.
*
* \note
* This API is available only for CAT1A devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkFastSetDivider
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkFastGetFrequency(void);

#endif /* (defined (CY_IP_MXS40SRSS) && defined (CY_IP_M4CPUSS)) || defined (CY_DOXYGEN) */

#if (defined (CY_IP_MXS40SRSS) && defined (CY_IP_M7CPUSS)) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysClk_ClkFastSrcSetDivider
****************************************************************************//**
*
* Sets the clock divider for the fast clock, which sources the main processor.
* The source of this divider is clkHf[0].
*
* \param clkFastNum 0 for CLOCK_FAST_0 and 1 for CLOCK_FAST_1
*
* \param intDiv Integer divider
*
* \param fracDiv Fractional divider
*
* \note
* Call \ref SystemCoreClockUpdate after this function calling.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates before calling this function if
* CLK_FAST frequency is increasing.
*
* \note
* Call \ref Cy_SysLib_SetWaitStates after calling this function if
* CLK_FAST frequency is decreasing.
*
* \note
* This API is available only for CAT1C devices.
*
*******************************************************************************/
void Cy_SysClk_ClkFastSrcSetDivider(uint32_t clkFastNum, uint8_t intDiv, uint8_t fracDiv);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkFastSrcGetDivider
****************************************************************************//**
*
* Returns the Integer and Fractional clock divider for the fast clock.
*
* \param clkFastNum 0 for CLOCK_FAST_0 and 1 for CLOCK_FAST_1
*
* \param dividerIntValue - Integer divider
*
* \param dividerFracValue - Fractional divider
*
* \return None. Loads pointed-to variables.
*
* \note
* This API is available only for CAT1C devices.
*
*******************************************************************************/
void Cy_SysClk_ClkFastSrcGetDivider(uint32_t clkFastNum, uint32_t *dividerIntValue, uint32_t *dividerFracValue);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkFastSrcGetFrequency
****************************************************************************//**
*
* Reports the frequency of the fast clock.
*
* \param clkFastNum 0 for CLOCK_FAST_0 and 1 for CLOCK_FAST_1
*
* \return The frequency, in Hz.
*
* \note
* This API is available only for CAT1C devices.
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkFastSrcGetFrequency(uint32_t clkFastNum);

#endif /* (defined (CY_IP_MXS40SRSS) && defined (CY_IP_M7CPUSS)) || defined (CY_DOXYGEN) */

/** \} group_sysclk_clk_fast_funcs */

#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXPERI_VERSION >= 3))  || defined (CY_IP_MXS22SRSS)

/* ========================================================================== */
/* ========================    PERI SECTION    ========================== */
/* ========================================================================== */

/**
* \addtogroup group_sysclk_clk_peripheral_group_enums
* \{
*/
/**
* Slave control Register Numbers
* Used with functions \ref Cy_SysClk_ClkHfSetDivider and \ref Cy_SysClk_ClkHfGetDivider.
*/
typedef enum
{
    CY_SYSCLK_PERI_GROUP_SL_CTL   = 0U,    /**<Selects SL_CTL*/
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS)  || defined (CY_IP_MXS22SRSS)
    CY_SYSCLK_PERI_GROUP_SL_CTL2  = 1U,    /**<Selects SL_CTL2*/
    CY_SYSCLK_PERI_GROUP_SL_CTL3  = 2U,    /**<Selects SL_CTL3*/
#endif /* defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS)  || defined (CY_IP_MXS22SRSS) */
} cy_en_peri_grp_sl_ctl_num_t;

/** \} group_sysclk_clk_peripheral_group_enums */

/** \cond internal */
/* Macro to validate if the SL control register number passed */
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS)
#define CY_SYSCLK_IS_SL_CTL_NUM_VALID(slaveCtl)           (((slaveCtl) == CY_SYSCLK_PERI_GROUP_SL_CTL) || \
                                                           ((slaveCtl) == CY_SYSCLK_PERI_GROUP_SL_CTL2) || \
                                                           ((slaveCtl) == CY_SYSCLK_PERI_GROUP_SL_CTL3))
#else
#define CY_SYSCLK_IS_SL_CTL_NUM_VALID(slaveCtl)           (((slaveCtl) == CY_SYSCLK_PERI_GROUP_SL_CTL))

#endif /* defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) */

/** \endcond */


/**
* \addtogroup group_sysclk_clk_peripheral_group_funcs
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupSetDivider
****************************************************************************//**
*
* Sets the divider value for a particular group
*
* \return \ref cy_en_sysclk_status_t
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* CAT1D devices - enum en_peri_grp_t(devices/COMPONENT_CAT1\<subcategory\>
* /include/\<series\>_config.h)
* CAT1B/CAT1C   - group number
*
* \param divider Selects the divider value
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B, CAT1C and CAT1D devices.
*
* \note
* Clock divider functionality is product specific, Refer to TRM before using this API
* Example:-
* For CAT1B devices Group-0 does not have the clock divider functionality.
* For CAT1C devices Group-0,1 and 2 does not have the clock divider functionality.
* For the above not supported groups this API will return success, but write will
* not happen.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PeriGroupSetDivider(uint32_t groupNum, uint32_t divider);


