zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupGetDivider
****************************************************************************//**
*
* Gets the divider value for a particular group
*
* \return Divider value
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* CAT1D devices - enum en_peri_grp_t(devices/COMPONENT_CAT1\<subcategory\>
* /include/\<series\>_config.h)
* CAT1B/CAT1C   - group number
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B, CAT1C and CAT1D devices.
*
* \note
* Clock divider functionality is product specific, Refer to TRM before using this API
* Example:-
* For CAT1B devices Group-0 does not have the clock divider functionality.
* For CAT1C devices Group-0,1 and 2 does not have the clock divider functionality.
* For the above not supported groups this API returns zero.
*
*******************************************************************************/
uint32_t Cy_SysClk_PeriGroupGetDivider(uint32_t groupNum);


/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupSetSlaveCtl
****************************************************************************//**
*
* Sets the particular Slave Control value for a particular group
*
* \return \ref cy_en_sysclk_status_t
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* CAT1D devices - enum en_peri_grp_t(devices/COMPONENT_CAT1\<subcategory\>
* /include/\<series\>_config.h)
* CAT1B/CAT1C   - group number
*
* \param slaveCtl Selects the Slave Control Register Number
*
* \param value Value to be written
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B, CAT1C and CAT1D devices.
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_PeriGroupSetSlaveCtl(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl, uint32_t value);

/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupGetSlaveCtl
****************************************************************************//**
*
* Gets the particular Slave Control value for a particular group
*
* \return Slave Control register value for a particular group
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* CAT1D devices - enum en_peri_grp_t(devices/COMPONENT_CAT1\<subcategory\>
* /include/\<series\>_config.h)
* CAT1B/CAT1C   - group number
*
* \param slaveCtl Selects the Slave Control Register Number
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B, CAT1C and CAT1D devices.
*
*******************************************************************************/
uint32_t Cy_SysClk_PeriGroupGetSlaveCtl(uint32_t groupNum, cy_en_peri_grp_sl_ctl_num_t slaveCtl);

/*******************************************************************************
* Function Name: Cy_SysClk_IsPeriGroupSlaveCtlSet
****************************************************************************//**
*
* Gets the mask value of particular slave control register for a particular group
*
* \return Divider value
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* CAT1D devices - enum en_peri_grp_t(devices/COMPONENT_CAT1\<subcategory\>
* /include/\<series\>_config.h)
* CAT1B/CAT1C   - group number
*
* \param slaveCtl Selects the Slave Control Register Number
*
* \param slaveMsk Selects the bit position(s) that needs to be obtained
*
* \note
* This API is available for CAT1A (TVIIBE only), CAT1B, CAT1C and CAT1D devices.
*
*******************************************************************************/
bool Cy_SysClk_IsPeriGroupSlaveCtlSet(uint32_t groupNum,cy_en_peri_grp_sl_ctl_num_t slaveCtl, uint32_t slaveMsk);

#if defined (CY_IP_MXS22SRSS)
/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupSlaveInit
****************************************************************************//**
*
* Initializes an IP
*
* \param periNum Selects the PERI Number
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* CAT1D devices - enum en_peri_grp_t(devices/COMPONENT_CAT1D
* /include/\<series\>_config.h)
*
* \param slaveNum Selects the bit position of the IP that needs to be enabled
*
* \param clkHfNum Selects the CLK_HF number that needs to be enabled for
* the IP to get enabled.
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
void Cy_SysClk_PeriGroupSlaveInit(uint32_t periNum, uint32_t groupNum, uint32_t slaveNum, uint32_t clkHfNum);

/*******************************************************************************
* Function Name: Cy_SysClk_PeriGroupSlaveDeinit
****************************************************************************//**
*
* Deinitializes an IP
*
* \param periNum Selects the PERI Number
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* CAT1D devices - enum en_peri_grp_t(devices/COMPONENT_CAT1D
* /include/\<series\>_config.h)
*
* \param slaveNum Selects the bit position of the IP that needs to be disabled
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
void Cy_SysClk_PeriGroupSlaveDeinit(uint32_t periNum, uint32_t groupNum, uint32_t slaveNum);

/*******************************************************************************
* Function Name: Cy_SysClk_IsPeriGroupSlaveEnabled
****************************************************************************//**
*
* Checks if a Slave Peripheral is enabled or not
*
* \param periNum Selects the PERI Number
*
* \param groupNum Selects the PERI Group Number
* \note
* Input of groupNum parameter will be
* CAT1D devices - enum en_peri_grp_t(devices/COMPONENT_CAT1D
* /include/\<series\>_config.h)
*
* \param slaveNum Selects the bit position of the IP that needs to be disabled
*
* \return The divider value.
* true - if slave is enabled, false - otherwise
*
* \note
* This API is available only for CAT1D devices.
*
*******************************************************************************/
bool Cy_SysClk_IsPeriGroupSlaveEnabled(uint32_t periNum, uint32_t groupNum, uint32_t slaveNum);

#endif /* defined (CY_IP_MXS22SRSS) */

/** \} group_sysclk_clk_peripheral_group_funcs */
#endif /* defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SSRSS) || (defined (CY_IP_MXS40SRSS) && (CY_IP_MXPERI_VERSION >= 3))  || defined (CY_IP_MXS22SRSS) */

/* ========================================================================== */
/* ========================    clk_peri SECTION    ========================== */
/* ========================================================================== */
#if defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SRSS)

/**
* \addtogroup group_sysclk_clk_peri_funcs
* \{
*/


