zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
#elif (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
typedef enum
{
    CY_SYSCLK_CLKLF_CSV_REF_ILO0   = 0U,  /**< Only Reference clock is the internal low speed oscillator (ILO0) */
    CY_SYSCLK_CLKLF_CSV_REF_ILO1   = 1U,  /**< Only Reference clock is the internal low speed oscillator (ILO1) */
} cy_en_clklf_csv_ref_clk_t;

#else
typedef enum
{
    CY_SYSCLK_CLKLF_CSV_REF_IMO    = 0U,  /**< Reference clock is the IMO */
    CY_SYSCLK_CLKLF_CSV_REF_EXT    = 1U,  /**< Reference clock is the external clock */
    CY_SYSCLK_CLKLF_CSV_REF_ECO    = 2U,  /**< Reference clock is ECO */
    CY_SYSCLK_CLKLF_CSV_REF_ALTHF0 = 3U,  /**< Reference clock is ALTHF0 */
    CY_SYSCLK_CLKLF_CSV_REF_IHO    = 4U,  /**< Reference clock is IHO */
    CY_SYSCLK_CLKLF_CSV_REF_ALTHF1 = 5U   /**< Reference clock is ALTHF1 */
} cy_en_clklf_csv_ref_clk_t;
#endif
#endif
/** \} group_sysclk_clk_lf_enums */

/**
* \addtogroup group_sysclk_clk_lf_structs
* \{
*/

#if defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || \
    (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
/**
* \note
* This structure is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
**/
typedef struct
{
    uint32_t startTime;    /**< Startup delay time, after enable or DeepSleep wakeup, from reference clock start to monitored clock start. */
    uint32_t lowerLimit;   /**< Lower limit in reference clock cycles, before the next monitored clock event is allowed to happen. */
    uint32_t upperLimit;   /**< Upper limit in reference clock cycles, before (or same time) the next monitored clock event must happen. */
    uint32_t period;       /**< Period in monitored clock cycles, before the next monitored clock event happens.  */
} cy_stc_clklf_csv_manual_config_t;

#endif

/** \} group_sysclk_clk_lf_structs */


/**
* \addtogroup group_sysclk_clk_lf_funcs
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysClk_ClkLfSetSource
****************************************************************************//**
*
* Sets the source for the low frequency clock(clkLf).
*
* \param source \ref cy_en_clklf_in_sources_t
*
* \note The watchdog timer (WDT) must be unlocked before calling this function.
*
* \note  It takes four cycles of the originally selected clock to switch away
* from it.  Do not disable the original clock during this time.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkLfSetSource
*
*******************************************************************************/
void Cy_SysClk_ClkLfSetSource(cy_en_clklf_in_sources_t source);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkLfGetSource
****************************************************************************//**
*
* Reports the source for the low frequency clock (clkLf).
*
* \return \ref cy_en_clklf_in_sources_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkLfSetSource
*
*******************************************************************************/
cy_en_clklf_in_sources_t Cy_SysClk_ClkLfGetSource(void);


#if defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || \
    (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) || \
    ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION == 2)) && \
    (defined (SRSS_HT_VARIANT) && (SRSS_HT_VARIANT == 1u)))

/*******************************************************************************
* Function Name: Cy_SysClk_ClkLfGetFrequency
****************************************************************************//**
*
* Reports the frequency of the clklf
*
* \return The frequency, in Hz.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkLfCSVConfig
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkLfGetFrequency(void);
#endif /* defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || \
    (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) || \
    ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION == 2)) && \
    (defined (SRSS_HT_VARIANT) && (SRSS_HT_VARIANT == 1u))) */


#if defined (CY_IP_MXS22SRSS) || (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || \
    ((defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) && defined(SRSS_CSV_LF_CSV_REF_CTL))
/*******************************************************************************
* Function Name: Cy_SysClk_ClkLfCsvGetRefFrequency
****************************************************************************//**
*
* Get the clklf csv reference clock frequency.
*
* \param refClk Reference clock source.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkLfCSVConfig
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkLfCsvGetRefFrequency(cy_en_clklf_csv_ref_clk_t refClk);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkLfCsvManualConfigure
****************************************************************************//**
*
* Manually configures the clklf csv based on user inputs.
*
* \param refClk Reference clock for csv operation.
*
* \param csvConfig Selects the csv configuration required.
*
* \return The frequency in Hz.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkLfCSVConfig
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkLfCsvManualConfigure(cy_en_clklf_csv_ref_clk_t refClk, const cy_stc_clklf_csv_manual_config_t * csvConfig);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkLfCsvConfigure
****************************************************************************//**
*
* Configures clklf csv.
*
* The configuration formula used is:
* Lower_limit = Target - Required accuracy/2
* Upper_limit = Target + Required accuracy/2
* Period = Target / (Reference frequency / Monitor frequency)
* Start_time = (Period +3) * (Reference frequency / Monitor frequency) - Upper_limit
*
* \param refClk Selects the reference clock for csv operation.
*
* \param accuracy Required accuracy.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkLfCSVConfig
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkLfCsvConfigure(cy_en_clklf_csv_ref_clk_t refClk, uint32_t accuracy);


