zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ClkLfCsvEnable
****************************************************************************//**
*
* Enables the csv for the clklf.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkLfCSVConfig
*
*******************************************************************************/
void Cy_SysClk_ClkLfCsvEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkLfCsvDisable
****************************************************************************//**
*
* Disables the csv for the clklf.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkLfCSVConfig
*
*******************************************************************************/
void Cy_SysClk_ClkLfCsvDisable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IsClkLfCsvEnabled
****************************************************************************//**
*
* Returns the enabled status of csv for the clklf.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkLfCSVConfig
*
*******************************************************************************/
bool Cy_SysClk_IsClkLfCsvEnabled(void);

#endif

/** \} group_sysclk_clk_lf_funcs */


/**
* \addtogroup group_sysclk_clk_ref_enums
* \{
*/

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))

/**
* clkref csv reference clock input sources.
*/
/**
* \note
* This enum is available for CAT1C devices.
**/

typedef enum
{
    CY_SYSCLK_CLKREF_CSV_REF_ILO0   = 0U,  /**< Only Reference clock is the internal low speed oscillator (ILO0) */
} cy_en_clkref_csv_ref_clk_t;


/**
* clkref csv supported action when an anomaly is detected.
*/
/**
* \note
* This enum is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
**/
typedef enum
{
    CY_SYSCLK_CLKREF_CSV_ACTION_FAULT    = 0U,  /**< Generates a fault */
    CY_SYSCLK_CLKREF_CSV_ACTION_RESET    = 1U  /**< Generates a Reset */
} cy_en_clkref_csv_action_t;
#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) */

/** \} group_sysclk_clk_ref_enums */

/**
* \addtogroup group_sysclk_clk_ref_structs
* \{
*/

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
/**
* \note
* This structure is available for CAT1C devices.
**/
typedef struct
{
    uint32_t startTime;    /**< Startup delay time, after enable or DeepSleep wakeup, from reference clock start to monitored clock start. */
    uint32_t lowerLimit;   /**< Lower limit in reference clock cycles, before the next monitored clock event is allowed to happen. */
    uint32_t upperLimit;   /**< Upper limit in reference clock cycles, before (or same time) the next monitored clock event must happen. */
    uint32_t period;       /**< Period in monitored clock cycles, before the next monitored clock event happens.  */
} cy_stc_clkref_csv_manual_config_t;

#endif

/** \} group_sysclk_clk_ref_structs */


/**
* \addtogroup group_sysclk_clk_ref_funcs
* \{
*/


#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3) && defined(SRSS_CSV_REF_CSV_REF_CTL))

/*******************************************************************************
* Function Name: Cy_SysClk_ClkRefGetFrequency
****************************************************************************//**
*
* Reports the frequency of the clkref
*
* \return The frequency, in Hz.
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkRefGetFrequency(void);

/*******************************************************************************
* Function Name: Cy_SysClk_ClkRefCsvGetRefFrequency
****************************************************************************//**
*
* Get the clkRef csv reference clock frequency.
*
* \param refClk Reference clock source.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkRefCSVConfig
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkRefCsvGetRefFrequency(cy_en_clkref_csv_ref_clk_t refClk);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkRefCsvManualConfigure
****************************************************************************//**
*
* Manually configures the clkRef csv based on user inputs.
*
* \param refClk Reference clock for csv operation.
*
* \param csvConfig Selects the csv configuration required.
*
* \return The frequency in Hz.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkRefCSVConfig
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkRefCsvManualConfigure(cy_en_clkref_csv_ref_clk_t refClk, const cy_stc_clkref_csv_manual_config_t * csvConfig);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkRefCsvConfigure
****************************************************************************//**
*
* Configures clkref csv.
*
* The configuration formula used is:
* Lower_limit = Target - Required accuracy/2
* Upper_limit = Target + Required accuracy/2
* Period = Target / (Reference frequency / Monitor frequency)
* Start_time = (Period +3) * (Reference frequency / Monitor frequency) - Upper_limit
*
* \param refClk Selects the reference clock for csv operation.
*
* \param accuracy Required accuracy.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkRefCSVConfig
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkRefCsvConfigure(cy_en_clkref_csv_ref_clk_t refClk, uint32_t accuracy);

