zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ClkRefCsvAction
****************************************************************************//**
*
* Configures the action taken when an anomaly is detected on the clkHf.
*
* \param action Action to be taken when anomaly is detected \ref cy_en_clkref_csv_action_t
*
* \note
* This API is available for CAT1B(PSOC C3), CAT1C, CAT1D devices.
*
*
*******************************************************************************/
void Cy_SysClk_ClkRefCsvAction(cy_en_clkref_csv_action_t action);

/*******************************************************************************
* Function Name: Cy_SysClk_ClkRefCsvEnable
****************************************************************************//**
*
* Enables the csv for the clkref.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkRefCSVConfig
*
*******************************************************************************/
void Cy_SysClk_ClkRefCsvEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkRefCsvDisable
****************************************************************************//**
*
* Disables the csv for the clkref.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkRefCSVConfig
*
*******************************************************************************/
void Cy_SysClk_ClkRefCsvDisable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IsClkRefCsvEnabled
****************************************************************************//**
*
* Returns the enabled status of csv for the clkref.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkRefCSVConfig
*
*******************************************************************************/
bool Cy_SysClk_IsClkRefCsvEnabled(void);

#endif

/** \} group_sysclk_clk_ref_funcs */


/**
* \addtogroup group_sysclk_clk_ilo_enums
* \{
*/

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))

/**
* clkilo csv reference clock input sources.
*/
/**
* \note
* This enum is available for CAT1C devices.
**/

typedef enum
{
    CY_SYSCLK_CLKILO_CSV_REF_LF   = 0U,  /**< Only Reference clock is the LF clock Not specifying the source */
} cy_en_clkilo_csv_ref_clk_t;

#endif /* (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3)) */

/** \} group_sysclk_clk_ilo_enums */

/**
* \addtogroup group_sysclk_clk_ilo_structs
* \{
*/

#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3))
/**
* \note
* This structure is available for CAT1C devices.
**/
typedef struct
{
    uint32_t startTime;    /**< Startup delay time, after enable or DeepSleep wakeup, from reference clock start to monitored clock start. */
    uint32_t lowerLimit;   /**< Lower limit in reference clock cycles, before the next monitored clock event is allowed to happen. */
    uint32_t upperLimit;   /**< Upper limit in reference clock cycles, before (or same time) the next monitored clock event must happen. */
    uint32_t period;       /**< Period in monitored clock cycles, before the next monitored clock event happens.  */
} cy_stc_clkilo_csv_manual_config_t;

#endif

/** \} group_sysclk_clk_ilo_structs */


/**
* \addtogroup group_sysclk_clk_ilo_funcs
* \{
*/


#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION >= 3) && defined(SRSS_CSV_ILO_CSV_REF_CTL))

/*******************************************************************************
* Function Name: Cy_SysClk_ClkIloGetFrequency
****************************************************************************//**
*
* Reports the frequency of the clkilo
*
* \return The frequency, in Hz.
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkIloGetFrequency(void);

/*******************************************************************************
* Function Name: Cy_SysClk_ClkIloCsvGetRefFrequency
****************************************************************************//**
*
* Get the clkIlo csv reference clock frequency.
*
* \param refClk Reference clock source.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkIloCSVConfig
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkIloCsvGetRefFrequency(cy_en_clkilo_csv_ref_clk_t refClk);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkIloCsvManualConfigure
****************************************************************************//**
*
* Manually configures the clkIlo csv based on user inputs.
*
* \param refClk Reference clock for csv operation.
*
* \param csvConfig Selects the csv configuration required.
*
* \return The frequency in Hz.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkIloCSVConfig
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkIloCsvManualConfigure(cy_en_clkilo_csv_ref_clk_t refClk, const cy_stc_clkilo_csv_manual_config_t * csvConfig);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkIloCsvConfigure
****************************************************************************//**
*
* Configures clkIlo csv.
*
* The configuration formula used is:
* Lower_limit = Target - Required accuracy/2
* Upper_limit = Target + Required accuracy/2
* Period = Target / (Reference frequency / Monitor frequency)
* Start_time = (Period +3) * (Reference frequency / Monitor frequency) - Upper_limit
*
* \param refClk Selects the reference clock for csv operation.
*
* \param accuracy Required accuracy.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkIloCSVConfig
*
*******************************************************************************/
cy_en_sysclk_status_t Cy_SysClk_ClkIloCsvConfigure(cy_en_clkilo_csv_ref_clk_t refClk, uint32_t accuracy);


