zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ClkIloCsvEnable
****************************************************************************//**
*
* Enables the csv for the clkIlo.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkIloCSVConfig
*
*******************************************************************************/
void Cy_SysClk_ClkIloCsvEnable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkIloCsvDisable
****************************************************************************//**
*
* Disables the csv for the clkIlo.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkIloCSVConfig
*
*******************************************************************************/
void Cy_SysClk_ClkIloCsvDisable(void);


/*******************************************************************************
* Function Name: Cy_SysClk_IsClkIloCsvEnabled
****************************************************************************//**
*
* Returns the enabled status of csv for the clkIlo.
*
* \return \ref cy_en_sysclk_status_t.
*
* \note
* This API is available for CAT1C devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkIloCSVConfig
*
*******************************************************************************/
bool Cy_SysClk_IsClkIloCsvEnabled(void);

#endif

/** \} group_sysclk_clk_ilo_funcs */



/* ========================================================================== */
/* ========================    clk_timer SECTION    ========================= */
/* ========================================================================== */
#if (defined (CY_IP_MXS40SRSS) && (CY_IP_MXS40SRSS_VERSION < 2)) || defined (CY_DOXYGEN)

/**
* \addtogroup group_sysclk_clk_timer_enums
* \{
*/
/**
* Timer clock (clk_timer) input sources. See CLK_TIMER_CTL register, TIMER_SEL
* and TIMER_HF0_DIV bits. Used with functions \ref Cy_SysClk_ClkTimerSetSource, and
* \ref Cy_SysClk_ClkTimerGetSource.
*/
typedef enum
{
    CY_SYSCLK_CLKTIMER_IN_IMO       = 0x000U, /**< clk_timer is sourced by the internal main oscillator (IMO) */
    CY_SYSCLK_CLKTIMER_IN_HF0_NODIV = 0x001U, /**< clk_timer is sourced by clkHf[0] undivided */
    CY_SYSCLK_CLKTIMER_IN_HF0_DIV2  = 0x101U, /**< clk_timer is sourced by clkHf[0] divided by 2 */
    CY_SYSCLK_CLKTIMER_IN_HF0_DIV4  = 0x201U, /**< clk_timer is sourced by clkHf[0] divided by 4 */
    CY_SYSCLK_CLKTIMER_IN_HF0_DIV8  = 0x301U  /**< clk_timer is sourced by clkHf[0] divided by 8 */
} cy_en_clktimer_in_sources_t;
/** \} group_sysclk_clk_timer_enums */

/** \cond */
#define CY_SRSS_CLK_TIMER_CTL_TIMER_Pos (SRSS_CLK_TIMER_CTL_TIMER_SEL_Pos)
#define CY_SRSS_CLK_TIMER_CTL_TIMER_Msk (SRSS_CLK_TIMER_CTL_TIMER_SEL_Msk | SRSS_CLK_TIMER_CTL_TIMER_HF0_DIV_Msk)
/** \endcond */

/**
* \addtogroup group_sysclk_clk_timer_funcs
* \{
*/

/*******************************************************************************
* Function Name: Cy_SysClk_ClkTimerSetSource
****************************************************************************//**
*
* Sets the source for the timer clock (clk_timer). The timer clock can be used
* as a source for SYSTICK as an alternate clock and one or more of the energy
* profiler counters.
*
* \param source \ref cy_en_clktimer_in_sources_t
*
* \note
* This API is available for CAT1A (excluding TVIIBE) devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkTimerSetSource
*
*******************************************************************************/
void Cy_SysClk_ClkTimerSetSource(cy_en_clktimer_in_sources_t source);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkTimerGetSource
****************************************************************************//**
*
* Reports the source for the timer clock (clk_timer).
*
* \return \ref cy_en_clktimer_in_sources_t
*
* \note
* This API is available for CAT1A (excluding TVIIBE) devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkTimerSetSource
*
*******************************************************************************/
cy_en_clktimer_in_sources_t Cy_SysClk_ClkTimerGetSource(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkTimerSetDivider
****************************************************************************//**
*
* Sets the divider for the timer clock (clk_timer).
*
* \param divider Divider value; valid range is 0 to 255. Divides the selected
* source (\ref Cy_SysClk_ClkTimerSetSource) by the (value + 1).
*
* \note
* Do not change the divider value while the timer clock is enabled.
*
* \note
* This API is available for CAT1A (excluding TVIIBE) devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkTimerSetDivider
*
*******************************************************************************/
void Cy_SysClk_ClkTimerSetDivider(uint8_t divider);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkTimerGetDivider
****************************************************************************//**
*
* Reports the divider value for the timer clock (clk_timer).
*
* \return The divider value
*
* \note
* This API is available for CAT1A (excluding TVIIBE) devices.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkTimerSetDivider
*
*******************************************************************************/
uint8_t Cy_SysClk_ClkTimerGetDivider(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkTimerEnable
****************************************************************************//**
*
* Enables the timer clock (clk_timer). The timer clock can be used as a source
* for SYSTICK and one or more of the energy profiler counters.
*
* \note
* This API is available for CAT1A (excluding TVIIBE) devices.
*
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkTimerEnable
*
*******************************************************************************/
void Cy_SysClk_ClkTimerEnable(void);


