zhanzr/cy8ckit-demo/app/mtb_shared/mtb-pdl-cat1/release-v3.23.0/drivers/include/cy_sysclk.h
/*******************************************************************************
* Function Name: Cy_SysClk_ClkBakGetSource
****************************************************************************//**
*
* Reports the source for the backup domain clock (clk_bak).
*
* \return \ref cy_en_clkbak_in_sources_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkBakSetSource
*
*******************************************************************************/
cy_en_clkbak_in_sources_t Cy_SysClk_ClkBakGetSource(void);
/** \} group_sysclk_clk_bak_funcs */


/** \cond */
/* Deprecated macros */
#define CY_SYSCLK_DIV_ROUND(a, b)   (CY_SYSLIB_DIV_ROUND((a),(b)))
#define CY_SYSCLK_DIV_ROUNDUP(a, b) (CY_SYSLIB_DIV_ROUNDUP((a),(b)))
/** \endcond */

/* ========================================================================== */
/* ==========================     Clock Power SECTION    =============================*/
/* ========================================================================== */
/**
* \addtogroup group_sysclk_clk_pwr_enums
* \{
*/
#if (defined (CY_IP_MXS40SSRSS) && (CY_MXS40SSRSS_VER_1_2 > 0UL)) || defined(CY_DOXYGEN)
/**
* \note
* This Enumeration is only available for CAT1B(B2) devices.
**/
/**
* Clock power input sources. See PWRMODE_CLK_SELECT register, PWR_MUX bits.
* Used with functions \ref Cy_SysClk_ClkPwrSetSource, and \ref Cy_SysClk_ClkPwrGetSource.
*/

typedef enum
{
    CY_SYSCLK_CLKPWR_IN_IMO   = 0U, /**< clkPwr is sourced by the internal main oscillator (IMO) */
    CY_SYSCLK_CLKPWR_IN_IHO   = 1U, /**< clkPwr is sourced by the internal high speed oscillator (IHO) */
} cy_en_clkpwr_in_sources_t;

/** \} group_sysclk_clk_pwr_enums */

/** \cond internal */
#define CY_SYSCLK_CLKPWR_DIVIDER_MIN                  (1U)
#define CY_SYSCLK_CLKPWR_DIVIDER_MAX                  (256U)
#define CY_SYSCLK_IS_CLKPWR_DIVIDER_VALID(locDiv)     ((CY_SYSCLK_CLKPWR_DIVIDER_MIN <= (locDiv)) && ((locDiv) <= CY_SYSCLK_CLKPWR_DIVIDER_MAX))

#define CY_SYSCLK_IF_CLKPWR_SOURCE_VALID(pwrClkSrc)    (((pwrClkSrc) == CY_SYSCLK_CLKPWR_IN_IMO) || \
                                                         ((pwrClkSrc) == CY_SYSCLK_CLKPWR_IN_IHO))
/** \endcond */

/**
* \addtogroup group_sysclk_clk_pwr_funcs
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysClk_ClkPwrSetDivider
****************************************************************************//**
*
* Sets the clock divider for Power clock.
*
* \param divider divider value between 1 and 256.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkPwrSetDivider
*
*******************************************************************************/
void Cy_SysClk_ClkPwrSetDivider(uint32_t divider);

/*******************************************************************************
* Function Name: Cy_SysClk_ClkPwrGetDivider
****************************************************************************//**
*
* Returns the clock divider of Power clock.
*
* \return divider value in range 1..256.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkPwrSetDivider
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkPwrGetDivider(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkPwrGetFrequency
****************************************************************************//**
*
* Reports the output clock signal frequency of Power clock.
*
* \return The frequency, in Hz.
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkPwrSetDivider
*
*******************************************************************************/
uint32_t Cy_SysClk_ClkPwrGetFrequency(void);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkPwrSetSource
****************************************************************************//**
*
* Sets the source for the Power clock.
*
* \param source \ref cy_en_clkpwr_in_sources_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkPwrSetSource
*
*******************************************************************************/
void Cy_SysClk_ClkPwrSetSource(cy_en_clkpwr_in_sources_t source);


/*******************************************************************************
* Function Name: Cy_SysClk_ClkPwrGetSource
****************************************************************************//**
*
* Reports the source for the Power clock.
*
* \return \ref cy_en_clkpwr_in_sources_t
*
* \funcusage
* \snippet sysclk/snippet/main.c snippet_Cy_SysClk_ClkPwrSetSource
*
*******************************************************************************/
cy_en_clkpwr_in_sources_t Cy_SysClk_ClkPwrGetSource(void);
/** \} group_sysclk_clk_pwr_funcs */
#endif


#if defined(__cplusplus)
}
#endif /* __cplusplus */

#endif /* defined (CY_IP_MXS28SRSS) || defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) */

#endif /* CY_SYSCLK_H */

/** \} group_sysclk */


/* [] END OF FILE */
